{
 "Yelp_Review": [
  {
   "Date_Posted": "10/7/2017",
   "Review_Comment": "Decided to stop while shopping nearby.\nYelp recommended\nGreat authentic food. Family all loved their choices!!\nClean, friendly staff.\nGood lunch crowd.\nHighly recommend\nWe will be back !!",
   "Name": "Frank C.",
   "Name_url": "https://www.yelp.com/user_details?userid=YvXj56ORDnDub9f7VVCB1A"
  },
  {
   "Date_Posted": "9/20/2017",
   "Review_Comment": "4.5 stars\nHubby was craving Mexican food so after searching Yelp all the great reviews led us here. This is as authentic as it gets, the food was delicious. The tortillas for the carne asada tacos were freshly made, they were very good. The beans and rice were perfect, they were seasoned perfectly, the beans had the perfect consistency. Hubby enjoyed his enchiladas, full of chicken. You have an option to dine or takeout. They have an extensive salsa bar and the green chile is very hot. They also have a dessert case for your sweet tooth. We came pretty late for takeout, and people never stopped coming in the whole time we were there. Everybody here is very friendly and the service was great. The only reason they fell short of 5 stars is because the tamale was pretty basic. I will be back to try something else off their extensive menu.",
   "Name": "Simone T.",
   "Name_url": "https://www.yelp.com/user_details?userid=DWpDDBJvO_fLqhwEwY2joQ"
  },
  {
   "Date_Posted": "7/5/2017",
   "Review_Comment": "I've had my eye on this place for awhile and finally got the chance to try it today! As soon as I walked in I was impressed by the cleanliness and the vibrant beauty of the salsa bar. The salsa bar sauces and the house salsa were really good! The menu is extensive with a lot of options, and we had vegetarian cuisine on our mind. My husband and I settled on the VEGETARIAN burrito & quesadillas.\nWhen our food came out shortly after ordering it looked so delicious and it was really delicious. It didn't cross my mind until we got our food to ask about pork being in the beans. The food runner quickly answered yes and walked away even though I told him we didn't eat pork and I removed the beans from my plate. I also noticed the beans in the burrito were the same. When I notified the server she informed us we would still have to pay for our \"pork\" burrito, but she could get us another one.\nThe experience of having to pay for an extra burrito that was advertised as vegetarian although it wasn't kind of outweighed the goodness of the food, but it's just a lesson learned. As an experienced server I don't understand the restaurant's policy but oh well. Just be sure not to order the beans if your vegetarian!",
   "Name": "Terran L.",
   "Name_url": "https://www.yelp.com/user_details?userid=O3DnB54JaW1bX4FDsUxMEg"
  },
  {
   "Date_Posted": "11/28/2017",
   "Review_Comment": "The best Mexican spot in Atlanta. Great food and service. Never have I ever been disappointed.",
   "Name": "Virginia C.",
   "Name_url": "https://www.yelp.com/user_details?userid=PcDuPiq8Yr1vmFV2SK-MGg"
  },
  {
   "Date_Posted": "10/19/2017",
   "Review_Comment": "If you are looking for authentic Mexican food this is your spot. waitress was attentive and helpful when placing our orders. the food was ready in no time and the cost was on point. check it out if you want some original cooking",
   "Name": "Anthony I.",
   "Name_url": "https://www.yelp.com/user_details?userid=xlDGWDRWEnxUSwl_CRxexQ"
  },
  {
   "Date_Posted": "11/22/2017",
   "Review_Comment": "The most authentic I have had outside of Cali. Love their food but it seems lately when I get their tacos they don't taste the same as they did the very first times I have had them. So, I tend to choose other foods opitions. The service has never let me down.",
   "Name": "Loryn J.",
   "Name_url": "https://www.yelp.com/user_details?userid=dHqBNeXiQUhbPk6mDgZ16w"
  },
  {
   "Date_Posted": "6/12/2017",
   "Review_Comment": "Tacos La Villa, watch out.\nNew Taqueria bae on the horizon. New to me. Where have I been? (Beside not venturing out to Jonesboro.)\nMy sister and I wanted to eat somewhere on one of our many jaunts up to Savannah. Usually we wait til we get there but knew it would be late so we hit up Yelp around this part of 75S.\nSO glad we did as Oaxaquenña is legit. Tacos with homemade tortillas, delicious flautas (per my sis), and not-dry, tasty tamales. And THE BEST salsa bar of any joint I've seen in the metro area. Everything was super fresh. About 4-5 salsas (avocado-based one was WOW), big chunks of pickled veggies (including potatoes which was new to me), and other goodies.\nTacos, tamale, flautas, and two horchatas for about $20. Prices and quality are A+.\nThe reason they lose a star is because on our way back from Savannah we wanted to stop in before hitting the city. Yelp has them closing at 11:30pm on a Sunday which I knew was probably wrong. Their website says 10pm. We got there around 9:20 and walked in. The guy at the register said unless we ordered for pickup, they were unfortunately closed. Say what? I told him their website says 10 and he said it was a recent change. OK. In that case, update your website and, maybe, lock the door.\nI think they possibly ran out of some things or maybe decided to just close early that night as several cars pulled up during this 3 minute timeframe and several other attempted to go in. As if this was not the norm.\nGiven the superb first experience, I'll forgive them and we will definitely return on our next road trip that takes us past Jonesboro. That flan is calling my name.",
   "Name": "Tamera B.",
   "Name_url": "https://www.yelp.com/user_details?userid=D3tebhijiSrm3DtON3oDqQ"
  },
  {
   "Date_Posted": "11/15/2017",
   "Review_Comment": "Great food with a fabulous salsa bar that includes guacamole. The authentic street tacos are the best, especially since I think they make their own tortillas in house.",
   "Name": "Jim M.",
   "Name_url": "https://www.yelp.com/user_details?userid=w3JLQA6OVXMJX_YQRqM7CA"
  },
  {
   "Date_Posted": "10/8/2016",
   "Review_Comment": "MMM! MMM! GOOD!\nI bookmarked this restaurant in advance of today's visit because I am not familiar with the area. We arrived just before noon and secured the last parking spot. The restaurant was very busy today. When you enter the restaurant, you will have a colorful electronic menu directly in front of you and a salsa bar off to your left. Seating will be on the left or right sides of this area.\nWe were able to be seated at the last open table, which was a two-seater in the section on the left. The room was very bright and colorful and furnished with simple wooden tables and chair Here's a tip: The table for two is usually a rectangle set close to the wall so that you are seated at the end. If you turn the table so that you are sitting at the side instead of the end, you will have more room. It was a nice atmosphere but the music was a bit too loud.\nThey have a huge menu with lots of American options like wings and fries, (for the uninitiated).\nWe decided to order the medium quesadilla that came with beans and rice and an El Pastor taco. We were provided chips and salsa while waiting for our meals. Usually, I largely ignore the chips but this time I indulged because they were fresh and warm and had a delightful authentic corn taste.\nWe didn't wait long for our meal and when it arrived, everything was hot and delivered as ordered. The El Pastor taco had great flavor but was a bit too salty probably because it was marinated. Next time, I will try the non-marinated option.\nThe quesadilla was perfection because it was well seasoned, stuffed with vegetables that had a slight char, and it was not dry. The medium would have been more than enough to fill me up and the large would have definitely gone unfinished. The rice was nicely seasoned but I found the beans to be a bit salty. Although a bit salty, the beans were very rich and had great flavor, (like they had been cooked in a cast iron pot all day until those flavors hit their peak).\nOverall, the food was very good and I definitely understand the ratings and why this place was so busy on a Saturday afternoon.\nDefinitely recommended, just watch that salt if it is an issue for you.",
   "Name": "Madelyn A.",
   "Name_url": "https://www.yelp.com/user_details?userid=uWhC9eof98zPkvsalgaqJw"
  },
  {
   "Date_Posted": "5/22/2017\nUpdated review",
   "Review_Comment": "Definitely worth pulling off 75 and having a great Mexican food for lunch or dinner! We were heading south on 75 from north Atlanta and I was searching for a place to stop for lunch on Yelp and we hit this gem! The lot was fairly packed when we pulled in, but fortunately we were able to grab a small table that was perfect for a party of two.\nAfter looking over their extensive menu, and being informed that their lunch specials were only available Mon - Fri 11 to 3 (this was Sunday) we opted for dinner items. My wife who is a big fan of tamales was thrilled to see they had a choice of four types to pick from! She went with the chicken with tomatillos sauce, another chicken with mole' sauce and a pork tamale with jalapeños. I opted for a new dish, that was their house special, a grilled or fried tortilla topped with your choice of meat, with jalapeños, tomatoes, lettuce, radishes, avocados, beans and a Mexican string cheese.\nI was blown away with the size of the tortilla dish (for $12.99) as it was the size a of a medium pizza having at least a diameter of 14\" (which would easily be shared with two or three people). My wife's tamales were all very flavorful and very fresh. There is a large fresh salsa bar that has guacamole and a large selection of salsas and sauces that we enhanced the already well flavored dishes. I was very pleased with the service. As you might of expected we had plenty of leftovers, especially when my wife wanted to try the flan. The flan portion was large and easily shared with two or more people being topped with fruit. It was probably the least favorite of the dishes we tried being denser than we liked and not as tasty as those we have had in the past. That being said their are a lot of other dessert options that I would try, having room when looking at the size of their portions.\nFood quality and taste - 4.5 stars - Very Good Mexican food!\nService - 4 stars - Good for a very busy time.\nAtmosphere - 3 stars casual, clean but nothing outstanding (I am looking for the best food!)\nPrice - 5 stars - Great value for money",
   "Name": "Ron P.",
   "Name_url": "https://www.yelp.com/user_details?userid=u7tbCCWV8g9IaOG3uORnyA"
  },
  {
   "Date_Posted": "8/6/2017",
   "Review_Comment": "Great authentic food here. We all got tacos, I got mine a la carte. The campechano one was the best - sausage and beef, well cooked and spiced. The chicken mole was good too! I added the salsa from the chips and the pepper on the side for some heat and that helped as there aren't really any extras (tortilla, meat, that was it. one had onions I guess).",
   "Name": "Krista H.",
   "Name_url": "https://www.yelp.com/user_details?userid=g1LkJdSXJJba3X-NK6Dm4A"
  },
  {
   "Date_Posted": "8/24/2017",
   "Review_Comment": "This is a good place to eat, authentic, tasteful, clean, good service, a more than complete salsa bar, music volume adequate, portions are more than decent.\nSoy de bien comer y este lugar está recomendado cien por ciento, al menos por la experiencia que tuve yo, muy sabroso, bien servido y auténtico.",
   "Name": "Miguel G.",
   "Name_url": "https://www.yelp.com/user_details?userid=JaMhpRyGIObKeAncobLmCg"
  },
  {
   "Date_Posted": "3/4/2017",
   "Review_Comment": "Absolutely delicious. Place is always packed. Finally decided to stop in. Authentic Mexican food. Glad I did. I had the Fluatas from the lunch menu for $6.99 (drink is not included). Service is great too. Not a lot of seating but there is enough. Definitely see them out growing this location soon.",
   "Name": "Michelle G.",
   "Name_url": "https://www.yelp.com/user_details?userid=kzyASWqM9ca3WuJSP0TDNA"
  },
  {
   "Date_Posted": "1/13/2017",
   "Review_Comment": "Dish I ordered: Al Pastor\nI was on my way back home from the airport then I decided to find a local restaurant to grab a quick lunch. Then, I saw Sonny's BBQ and I pulled in. When I was about to get off, I saw this Mexican place that looked great. As soon as I opened my yelp app, it told me this is a hot spot for authentic Mexican food.\nAs soon as I entered, I noticed a salsa bar that had guacamole, various salsa and vegetables. All looked fresh to me.\nAl Pastor was a huge success for me. The pork was juicy and tender. Seasoned perfectly. They serve huge portions so I did not get to finish it even though I enjoyed it thoroughly. Rice was a little different I. A good way, cooked very softly so it's easily digestible. Sides of lettuce, onions, cilantro and avocado were very fresh and goes well with the dish.\nI will definitely be back with my friends next time to try something different.",
   "Name": "Benjamin Y.",
   "Name_url": "https://www.yelp.com/user_details?userid=cyDHe2lEv7PQOygeEq7Wpw"
  },
  {
   "Date_Posted": "2/20/2017",
   "Review_Comment": "Best steak tacos I have ever had in the US! Hands down! I could stop there but I owe it to those who will review comments to make a decision on this place to know that if they forgo eating here, then they will have made a horrible decision. The steak was cooked perfectly and I was given huge portions of it. The lettuce, onions and salsa were fresh and just made the tacos that much better. The corn tortillas were warm and perfect. You will not eat better authentic Mexican food than La Oaxaquena! This trumps the chain tex mex so many Americans like and is anything but tex mex. This is the real deal for real foodies looking for authentic Mexican food. Make it a priority to eat here! Service was great and the restaurant was well maintained.",
   "Name": "Joe L.",
   "Name_url": "https://www.yelp.com/user_details?userid=EcFRK0ZThQolPgXZASeS_Q"
  },
  {
   "Date_Posted": "11/20/2017",
   "Review_Comment": "The food is good and pretty authentic. The prices are reasonable. The atmosphere is more like a fast food restaurant and they will not give you free refills on tea or soda. It's a decent place for lunch.",
   "Name": "Carrie R.",
   "Name_url": "https://www.yelp.com/user_details?userid=ZvCb611OvO0FS1R7axayJw"
  },
  {
   "Date_Posted": "5/18/2017",
   "Review_Comment": "This place actually lived up to the hype! The food was so good! Everything we had was out of this world. We live in Marietta almost 1hr 15 min away it was not only worth the trip - I will be bring my friends here.\nOMG the sauces were so authentic - the Tres Leche WTF!! Get up and come here.",
   "Name": "Norbert C.",
   "Name_url": "https://www.yelp.com/user_details?userid=loL96zaksHCYfGkGWfh5_w"
  },
  {
   "Date_Posted": "9/16/2017",
   "Review_Comment": "One of my boyfriend n I fav spots in Morrow. I recommend the Horchata, steak & chicken quesadilla and the burritos are pretty good as well!",
   "Name": "Stephanie C.",
   "Name_url": "https://www.yelp.com/user_details?userid=1aQoBIyf8aAhBDgyK8c3gg"
  },
  {
   "Date_Posted": "6/11/2017",
   "Review_Comment": "By far the best Mexican restaurant I have ever been to! The pork gordita was in the most delicious corn cake and the beef cheek tacos were out of this world good!\nPrices are extremely good and the menu was packed with so many choices!",
   "Name": "Kate B.",
   "Name_url": "https://www.yelp.com/user_details?userid=WqwWxOWGOap2Pt6pvLDF1A"
  },
  {
   "Date_Posted": "9/20/2017",
   "Review_Comment": "This is my favorite Mexican taqueria since now! It's close from my work! I love the salad bar everything is clean and good cx service. They work as a real team. The menu is very complete!",
   "Name": "Jeniree O.",
   "Name_url": "https://www.yelp.com/user_details?userid=IxtmpEw6WaeN18Bf4N6UgA"
  },
  {
   "Date_Posted": "1/25/2016",
   "Review_Comment": "Joining the chorus of fans here. Oaxaquena may have the best Mexican food in the Atlanta metro area. I'm impressed.\nTwo visits:\nSteak taco, Mexican. Super excellent. Nice soft tortilla, well-seasoned meat. Good beans. Rice just OK.\nChicken enchiladas verdes - outstanding, and you get four of them! Plus rice, beans and small salad. The green sauce is some the best I've had.\nQueso tamales - I ordered two as take-out. They were already boxed up and ready for me when I checked out. Excellent tamales and a steal at the price.\nSalsa bar is to die for. Best salsa bar ever. If you like hot and tasty, make your way to La Oaxaquena.\nFree chips & salsa and even that salsa is good although I kicked it up three notches with the red chile sauce from the salsa bar. Chips were fresh.\nGood service - the food comes out fairly quickly but it takes a while to get the check. The second time here, after sitting with a pushed-away plate for fifteen minutes, I eventually went up to the register and flagged my server. Maybe that's how you need to do it, although I saw several tables get their check in good time. Maybe it's just my server (same one both times).\nPlenty of parking.\nHighly recommended.",
   "Name": "Robin S.",
   "Name_url": "https://www.yelp.com/user_details?userid=0XOVMcvzlfKRPqjbmCN5pQ"
  },
  {
   "Date_Posted": "10/29/2017",
   "Review_Comment": "I had a torta and it was flavorful. Great seasoning on the meat and the avocado on the sandwich made it offset.",
   "Name": "Dee W.",
   "Name_url": "https://www.yelp.com/user_details?userid=h-wAcjcUC_cFMn8vKkzx5g"
  },
  {
   "Date_Posted": "9/23/2016",
   "Review_Comment": "First time visit (9/22/16) and my first impression upon entering is *dive*!\nIt's a small place, nothing fancy but have to say the food was fresh and good.\n*Side note.....they need to renovate, make the place bigger and add some alcoholic beverages to the menu.....no margaritas a real bummer!\nI will echo what others have said, seems pretty authentic when compared to the other Mexican restaurants in the area.\nSon had the lengua taco (beef tongue) I had the flautas, both were good. If you are expecting the typical shredded chicken inside the flautas don't because they fry the chicken. Flavor was good but would have preferred the regular shredded chicken. Very fresh salsa and chips. I should also give a special mention to the refried beans that came with my entrée....must say that unlike other Mexican places they actually put some flavor in them!\nAlso had the mango bebida (shake).....it looked better than it tasted and was expensive @ $5.95. The flavor of the fruit did not come through well....\nWill I return again? Yes, but next time will skip the shake. See pictures!",
   "Name": "Keysha P.",
   "Name_url": "https://www.yelp.com/user_details?userid=OoGzz5hV54aeuTi1g_YLPg"
  },
  {
   "Date_Posted": "6/27/2016",
   "Review_Comment": "Real deal authentic stuff. I mean you should brush up on your Spanish before coming here. I said dine in 5 times and she still put my order in a to-go box. I got the lunch special, $6 for over 15 menu items. No drink included. I ordered the chicken burrito and it came with rice and beans. I also ordered the mango juice. Pretty good, not overly sweet. They also give chips and salsa if you dine in. It was overall pretty good, I might stop by next time I'm in the area",
   "Name": "LaShonda H.",
   "Name_url": "https://www.yelp.com/user_details?userid=-uIXd009v-3saovHoW1-Mw"
  },
  {
   "Date_Posted": "1/8/2017",
   "Review_Comment": "Love love love this place. Food quality and service is spectacular. I got a little too happy my first time there and over ordered but it was so worth it. Very authentic. This place is never a disappointment. Marinated pork taco was seasoned very well. Topped it with some spicy salsa which was great. Chorizo taco was a little salty but still delish. My favorite has to be their steak taco. Their wings are always a good size, can't go wrong there. There's also complimentary chips and salsa!",
   "Name": "Lisa H.",
   "Name_url": "https://www.yelp.com/user_details?userid=YKto1DwPw5HCEItJgiLrdA"
  },
  {
   "Date_Posted": "7/20/2017",
   "Review_Comment": "I really like this place! Very authentic Mexican food. I had the flutas and my husband had the beef tacos. We both had the mango juice which tasted as if a fresh mango had been squeezed into our cup! The chips came out warm and I loved the salsa bar that they had.",
   "Name": "Glennell W.",
   "Name_url": "https://www.yelp.com/user_details?userid=3S3QuFJdPZ2qf_nj8vxTgQ"
  },
  {
   "Date_Posted": "1/10/2017",
   "Review_Comment": "Met here last Friday to celebrate a gym buddy's bday. I'm going to be totally honest here, sometime last year some friends and I popped in here randomly but we chose not to eat here because of the health inspection score posted..I think it was like 70 or 80 something at the time (clutched pearls). During this visit I was super skeptical and had in my mind to just show up to celebrate, but not eat, however upon entry I noted that the score vastly improved and is currently at a 97 (A). Now on to the food, well my dish at least. I ordered the chicken enchiladas with red sauce--freakin delicious! I was confused at first because when the server sat the plate down, it had this big, thin piece of steak on it..okay, wasn't complaining. The lettuce and tomato served with it was very crunchy and fresh. The table tortilla chips I tried were not greasy, but slightly salty. They also had two types of salsa..be warned if you ask for the spicy (understatement) salsa...its beyond spicy and I LOVE spicy food, but I had to step back from that. No one at the table, there were 8 of us, complained about their food. Oh, you should note that they DO NOT serve alcohol here...so it's virgin everything.",
   "Name": "Devika H.",
   "Name_url": "https://www.yelp.com/user_details?userid=_s5P-AvmMn_u-l474KTf-A"
  },
  {
   "Date_Posted": "7/6/2016",
   "Review_Comment": "HANDS DOWN BEST SPOT in GEORGIA to eat authentic Mexican food! The service is hard to predict, between 3 and 5 stars depending on how busy they are-- but the size of the portions, the wide ranging menu and the consistent food quality requires this 5 star rating. This is the only spot in the ATL that I know of that serves vegetarian tamales,-- delicious, succulent, perfectly flavored vegetarian tamales. They also have a salsa bar so you can have as much red, green and avocado salsa as you want. One notable drawback: No margaritas :( BUT THIS PLACE IS SO GOOD THEY DON'T NEED A LIQUOR LICENSE. Parking can be difficult during peak hours.",
   "Name": "Thuy P.",
   "Name_url": "https://www.yelp.com/user_details?userid=M2Ef2z92j7A_vflNRNEVyg"
  },
  {
   "Date_Posted": "11/28/2016",
   "Review_Comment": "I'm a girl from Texas who lives in the deep south. Finding authentic Mexican food is very much a chore. I stumbled across Taqueria La Oaxaquena via a Yelp. It got good reviews, so I decided to give it a try. It was a little taste of the southwest in Jonesboro, GA. The carne asada is juicy and flavorful. I will definitely be returning when I'm back in the area.",
   "Name": "Chelle R.",
   "Name_url": "https://www.yelp.com/user_details?userid=NTKDMcOFPQMaJQ7CQZ1LEA"
  },
  {
   "Date_Posted": "12/18/2016",
   "Review_Comment": "We had the mole, a chicken quesadilla & tacos with a side of guacamole. The mole was just okay nothing remarkable..the tacos were just meat in between corn tortillas...no cheese or garnish...the quesadillas were fine but again nothing really to brag on..I was really looking 4ward to going here after reading the reviews but im was kinda dissappointed. Everything was hot and fresh and the refried beans had good flavor.",
   "Name": "Heather C.",
   "Name_url": "https://www.yelp.com/user_details?userid=9BsoKEpkW3okjrUAOkOM3Q"
  },
  {
   "Date_Posted": "2/2/2017",
   "Review_Comment": "Taco Salad delicious, salsa very good and also tamales are mega yummy..., place very clean, service very good, desserts are real Mexican and good flavour.",
   "Name": "Brenda O.",
   "Name_url": "https://www.yelp.com/user_details?userid=QFho0PXt3-_QL8bKbA9AjQ"
  },
  {
   "Date_Posted": "4/7/2016",
   "Review_Comment": "Pretty damn good mexican food for atlanta. Being from so. Cal. I know whats up\nTry the harache and the tacos\nCarnitas are very good",
   "Name": "Shawn V.",
   "Name_url": "https://www.yelp.com/user_details?userid=CuGj87JlZ11XXeLcJq1UOw"
  },
  {
   "Date_Posted": "9/27/2016",
   "Review_Comment": "After coming in for lunch with some family I can see why this place is so highly reviewed. For starters there are plenty of menu items that I have never come across and always wanted to try. For example, cow cheek, tripe and goat are all options that are exciting to undertake for the first time. I appreciate the menu segregated into \"mexi-american\" and more traditional choices. Obviously, going with the later would be recommended and it gives you a feeling of traveling without ever having to leave the country. I opted for the mole tamale and chilli relleno. It's rare to find a restaurant that even offers mole much less takes pride enough to offer a variety. The flavors were deep, intense and almost chocolatey. The staff was friendly and prices are uber cheap so I quickly became a fan and will have to come again next time I'm in town. Thanks!",
   "Name": "Ben T.",
   "Name_url": "https://www.yelp.com/user_details?userid=-fh8LjJKj34MLGLn-OhaAA"
  },
  {
   "Date_Posted": "3/28/2016",
   "Review_Comment": "I live in Austin, Texas and have also traveled to Mexico 3 times. I LOVE good Mexican and hate bad Mexican food. The difference here is that the quality of the ingredients is super fresh, and their flavors are fantastic!\nI am value shopper, and this place is even more amazing considering their prices. If you're in the Atlanta airport area, and you want Mexican food, don't go anywhere else!",
   "Name": "Rob J.",
   "Name_url": "https://www.yelp.com/user_details?userid=lfBRbILf8oqV9hvAOhLS1A"
  },
  {
   "Date_Posted": "9/20/2017",
   "Review_Comment": "This is definitely the best place to get authentic Mexican food in Atlanta. They have everything you could want out of an authentic Mexican fast(ish) food experience, except for beer. The tortillas, tamales and mole are handmade, they have an incredible salsa bar, and it's the only place that has Tlayudas (google them, you won't be disappointed in the concept, or on the dish when you come and try them). On the weekend they have special hangover dishes like Pozole and Menudo. I recommend this place to everyone I know. It's LEGIT.",
   "Name": "Jordi C.",
   "Name_url": "https://www.yelp.com/user_details?userid=fQTBD90dpTvHvkwLivUVKw"
  },
  {
   "Date_Posted": "6/5/2017",
   "Review_Comment": "Excellent. Fresh and prepared as it should be. It's a great sign when you see the natives of these dishes eating here and with good reason. Great homemade sauces and condiments. I recommend 100%.",
   "Name": "Al N.",
   "Name_url": "https://www.yelp.com/user_details?userid=SyTMVvBXJQIKFjM26IzbJA"
  },
  {
   "Date_Posted": "6/13/2017",
   "Review_Comment": "This place has the best food ever time I go. Their staff is polite and fast. Never dine in I've always taken my order to go. Try the Tlayuda it's really good!!!",
   "Name": "Renee ..",
   "Name_url": "https://www.yelp.com/user_details?userid=aQ5CthFiH9Llm0L5So9v8g"
  },
  {
   "Date_Posted": "6/19/2016",
   "Review_Comment": "What can you say?\nAmazing food, huge quantities, and very affordable. I just hope with all these positive yelp reviews, there will be space for me in the future.",
   "Name": "Scott H.",
   "Name_url": "https://www.yelp.com/user_details?userid=cqxtajCDTePY90hHHWujMA"
  },
  {
   "Date_Posted": "4/27/2017\nUpdated review",
   "Review_Comment": "I came because of the reviews but. The service was not great she didn't check on us. I was eating and a damn spider crawled on my arm from the ceiling. I mean I know every place has them but I won't b returning. No Bueno",
   "Name": "Kashmere J.",
   "Name_url": "https://www.yelp.com/user_details?userid=Zj989wRjchs2ZduEKU7Vaw"
  },
  {
   "Date_Posted": "9/28/2016",
   "Review_Comment": "Well well I can't believe I've waited this long to review this wonderful Mexican restaurant! Had a meeting in the area with co-workers and found this place through Yelp! So tasty and very authentic. Had the carne asada and carnitas tacos. Food was wonderfully seasoned with just the right amount. Love the salsa bar. Co-workers had enchiladas, quesadillas- everyone loved the food. We also shared cheese dips and guacamole. I love chunky guacamole and this fit the bill.\nYou could tell this was a popular and authentic place with white collar and blue collar coming together to enjoy good food. It was very busy but service and food was very timely.\nCan't wait to go again!",
   "Name": "Sherrie H.",
   "Name_url": "https://www.yelp.com/user_details?userid=AICrlRrcoig1x2m7geJaQg"
  },
  {
   "Date_Posted": "10/7/2017",
   "Review_Comment": "Decided to stop while shopping nearby.\nYelp recommended\nGreat authentic food. Family all loved their choices!!\nClean, friendly staff.\nGood lunch crowd.\nHighly recommend\nWe will be back !!",
   "Name": "Frank C.",
   "Name_url": "https://www.yelp.com/user_details?userid=YvXj56ORDnDub9f7VVCB1A"
  },
  {
   "Date_Posted": "9/20/2017",
   "Review_Comment": "4.5 stars\nHubby was craving Mexican food so after searching Yelp all the great reviews led us here. This is as authentic as it gets, the food was delicious. The tortillas for the carne asada tacos were freshly made, they were very good. The beans and rice were perfect, they were seasoned perfectly, the beans had the perfect consistency. Hubby enjoyed his enchiladas, full of chicken. You have an option to dine or takeout. They have an extensive salsa bar and the green chile is very hot. They also have a dessert case for your sweet tooth. We came pretty late for takeout, and people never stopped coming in the whole time we were there. Everybody here is very friendly and the service was great. The only reason they fell short of 5 stars is because the tamale was pretty basic. I will be back to try something else off their extensive menu.",
   "Name": "Simone T.",
   "Name_url": "https://www.yelp.com/user_details?userid=DWpDDBJvO_fLqhwEwY2joQ"
  },
  {
   "Date_Posted": "7/5/2017",
   "Review_Comment": "I've had my eye on this place for awhile and finally got the chance to try it today! As soon as I walked in I was impressed by the cleanliness and the vibrant beauty of the salsa bar. The salsa bar sauces and the house salsa were really good! The menu is extensive with a lot of options, and we had vegetarian cuisine on our mind. My husband and I settled on the VEGETARIAN burrito & quesadillas.\nWhen our food came out shortly after ordering it looked so delicious and it was really delicious. It didn't cross my mind until we got our food to ask about pork being in the beans. The food runner quickly answered yes and walked away even though I told him we didn't eat pork and I removed the beans from my plate. I also noticed the beans in the burrito were the same. When I notified the server she informed us we would still have to pay for our \"pork\" burrito, but she could get us another one.\nThe experience of having to pay for an extra burrito that was advertised as vegetarian although it wasn't kind of outweighed the goodness of the food, but it's just a lesson learned. As an experienced server I don't understand the restaurant's policy but oh well. Just be sure not to order the beans if your vegetarian!",
   "Name": "Terran L.",
   "Name_url": "https://www.yelp.com/user_details?userid=O3DnB54JaW1bX4FDsUxMEg"
  },
  {
   "Date_Posted": "11/28/2017",
   "Review_Comment": "The best Mexican spot in Atlanta. Great food and service. Never have I ever been disappointed.",
   "Name": "Virginia C.",
   "Name_url": "https://www.yelp.com/user_details?userid=PcDuPiq8Yr1vmFV2SK-MGg"
  },
  {
   "Date_Posted": "10/19/2017",
   "Review_Comment": "If you are looking for authentic Mexican food this is your spot. waitress was attentive and helpful when placing our orders. the food was ready in no time and the cost was on point. check it out if you want some original cooking",
   "Name": "Anthony I.",
   "Name_url": "https://www.yelp.com/user_details?userid=xlDGWDRWEnxUSwl_CRxexQ"
  },
  {
   "Date_Posted": "11/22/2017",
   "Review_Comment": "The most authentic I have had outside of Cali. Love their food but it seems lately when I get their tacos they don't taste the same as they did the very first times I have had them. So, I tend to choose other foods opitions. The service has never let me down.",
   "Name": "Loryn J.",
   "Name_url": "https://www.yelp.com/user_details?userid=dHqBNeXiQUhbPk6mDgZ16w"
  },
  {
   "Date_Posted": "6/12/2017",
   "Review_Comment": "Tacos La Villa, watch out.\nNew Taqueria bae on the horizon. New to me. Where have I been? (Beside not venturing out to Jonesboro.)\nMy sister and I wanted to eat somewhere on one of our many jaunts up to Savannah. Usually we wait til we get there but knew it would be late so we hit up Yelp around this part of 75S.\nSO glad we did as Oaxaquenña is legit. Tacos with homemade tortillas, delicious flautas (per my sis), and not-dry, tasty tamales. And THE BEST salsa bar of any joint I've seen in the metro area. Everything was super fresh. About 4-5 salsas (avocado-based one was WOW), big chunks of pickled veggies (including potatoes which was new to me), and other goodies.\nTacos, tamale, flautas, and two horchatas for about $20. Prices and quality are A+.\nThe reason they lose a star is because on our way back from Savannah we wanted to stop in before hitting the city. Yelp has them closing at 11:30pm on a Sunday which I knew was probably wrong. Their website says 10pm. We got there around 9:20 and walked in. The guy at the register said unless we ordered for pickup, they were unfortunately closed. Say what? I told him their website says 10 and he said it was a recent change. OK. In that case, update your website and, maybe, lock the door.\nI think they possibly ran out of some things or maybe decided to just close early that night as several cars pulled up during this 3 minute timeframe and several other attempted to go in. As if this was not the norm.\nGiven the superb first experience, I'll forgive them and we will definitely return on our next road trip that takes us past Jonesboro. That flan is calling my name.",
   "Name": "Tamera B.",
   "Name_url": "https://www.yelp.com/user_details?userid=D3tebhijiSrm3DtON3oDqQ"
  },
  {
   "Date_Posted": "11/15/2017",
   "Review_Comment": "Great food with a fabulous salsa bar that includes guacamole. The authentic street tacos are the best, especially since I think they make their own tortillas in house.",
   "Name": "Jim M.",
   "Name_url": "https://www.yelp.com/user_details?userid=w3JLQA6OVXMJX_YQRqM7CA"
  },
  {
   "Date_Posted": "10/8/2016",
   "Review_Comment": "MMM! MMM! GOOD!\nI bookmarked this restaurant in advance of today's visit because I am not familiar with the area. We arrived just before noon and secured the last parking spot. The restaurant was very busy today. When you enter the restaurant, you will have a colorful electronic menu directly in front of you and a salsa bar off to your left. Seating will be on the left or right sides of this area.\nWe were able to be seated at the last open table, which was a two-seater in the section on the left. The room was very bright and colorful and furnished with simple wooden tables and chair Here's a tip: The table for two is usually a rectangle set close to the wall so that you are seated at the end. If you turn the table so that you are sitting at the side instead of the end, you will have more room. It was a nice atmosphere but the music was a bit too loud.\nThey have a huge menu with lots of American options like wings and fries, (for the uninitiated).\nWe decided to order the medium quesadilla that came with beans and rice and an El Pastor taco. We were provided chips and salsa while waiting for our meals. Usually, I largely ignore the chips but this time I indulged because they were fresh and warm and had a delightful authentic corn taste.\nWe didn't wait long for our meal and when it arrived, everything was hot and delivered as ordered. The El Pastor taco had great flavor but was a bit too salty probably because it was marinated. Next time, I will try the non-marinated option.\nThe quesadilla was perfection because it was well seasoned, stuffed with vegetables that had a slight char, and it was not dry. The medium would have been more than enough to fill me up and the large would have definitely gone unfinished. The rice was nicely seasoned but I found the beans to be a bit salty. Although a bit salty, the beans were very rich and had great flavor, (like they had been cooked in a cast iron pot all day until those flavors hit their peak).\nOverall, the food was very good and I definitely understand the ratings and why this place was so busy on a Saturday afternoon.\nDefinitely recommended, just watch that salt if it is an issue for you.",
   "Name": "Madelyn A.",
   "Name_url": "https://www.yelp.com/user_details?userid=uWhC9eof98zPkvsalgaqJw"
  },
  {
   "Date_Posted": "5/22/2017\nUpdated review",
   "Review_Comment": "Definitely worth pulling off 75 and having a great Mexican food for lunch or dinner! We were heading south on 75 from north Atlanta and I was searching for a place to stop for lunch on Yelp and we hit this gem! The lot was fairly packed when we pulled in, but fortunately we were able to grab a small table that was perfect for a party of two.\nAfter looking over their extensive menu, and being informed that their lunch specials were only available Mon - Fri 11 to 3 (this was Sunday) we opted for dinner items. My wife who is a big fan of tamales was thrilled to see they had a choice of four types to pick from! She went with the chicken with tomatillos sauce, another chicken with mole' sauce and a pork tamale with jalapeños. I opted for a new dish, that was their house special, a grilled or fried tortilla topped with your choice of meat, with jalapeños, tomatoes, lettuce, radishes, avocados, beans and a Mexican string cheese.\nI was blown away with the size of the tortilla dish (for $12.99) as it was the size a of a medium pizza having at least a diameter of 14\" (which would easily be shared with two or three people). My wife's tamales were all very flavorful and very fresh. There is a large fresh salsa bar that has guacamole and a large selection of salsas and sauces that we enhanced the already well flavored dishes. I was very pleased with the service. As you might of expected we had plenty of leftovers, especially when my wife wanted to try the flan. The flan portion was large and easily shared with two or more people being topped with fruit. It was probably the least favorite of the dishes we tried being denser than we liked and not as tasty as those we have had in the past. That being said their are a lot of other dessert options that I would try, having room when looking at the size of their portions.\nFood quality and taste - 4.5 stars - Very Good Mexican food!\nService - 4 stars - Good for a very busy time.\nAtmosphere - 3 stars casual, clean but nothing outstanding (I am looking for the best food!)\nPrice - 5 stars - Great value for money",
   "Name": "Ron P.",
   "Name_url": "https://www.yelp.com/user_details?userid=u7tbCCWV8g9IaOG3uORnyA"
  },
  {
   "Date_Posted": "8/6/2017",
   "Review_Comment": "Great authentic food here. We all got tacos, I got mine a la carte. The campechano one was the best - sausage and beef, well cooked and spiced. The chicken mole was good too! I added the salsa from the chips and the pepper on the side for some heat and that helped as there aren't really any extras (tortilla, meat, that was it. one had onions I guess).",
   "Name": "Krista H.",
   "Name_url": "https://www.yelp.com/user_details?userid=g1LkJdSXJJba3X-NK6Dm4A"
  },
  {
   "Date_Posted": "8/24/2017",
   "Review_Comment": "This is a good place to eat, authentic, tasteful, clean, good service, a more than complete salsa bar, music volume adequate, portions are more than decent.\nSoy de bien comer y este lugar está recomendado cien por ciento, al menos por la experiencia que tuve yo, muy sabroso, bien servido y auténtico.",
   "Name": "Miguel G.",
   "Name_url": "https://www.yelp.com/user_details?userid=JaMhpRyGIObKeAncobLmCg"
  },
  {
   "Date_Posted": "3/4/2017",
   "Review_Comment": "Absolutely delicious. Place is always packed. Finally decided to stop in. Authentic Mexican food. Glad I did. I had the Fluatas from the lunch menu for $6.99 (drink is not included). Service is great too. Not a lot of seating but there is enough. Definitely see them out growing this location soon.",
   "Name": "Michelle G.",
   "Name_url": "https://www.yelp.com/user_details?userid=kzyASWqM9ca3WuJSP0TDNA"
  },
  {
   "Date_Posted": "1/13/2017",
   "Review_Comment": "Dish I ordered: Al Pastor\nI was on my way back home from the airport then I decided to find a local restaurant to grab a quick lunch. Then, I saw Sonny's BBQ and I pulled in. When I was about to get off, I saw this Mexican place that looked great. As soon as I opened my yelp app, it told me this is a hot spot for authentic Mexican food.\nAs soon as I entered, I noticed a salsa bar that had guacamole, various salsa and vegetables. All looked fresh to me.\nAl Pastor was a huge success for me. The pork was juicy and tender. Seasoned perfectly. They serve huge portions so I did not get to finish it even though I enjoyed it thoroughly. Rice was a little different I. A good way, cooked very softly so it's easily digestible. Sides of lettuce, onions, cilantro and avocado were very fresh and goes well with the dish.\nI will definitely be back with my friends next time to try something different.",
   "Name": "Benjamin Y.",
   "Name_url": "https://www.yelp.com/user_details?userid=cyDHe2lEv7PQOygeEq7Wpw"
  },
  {
   "Date_Posted": "2/20/2017",
   "Review_Comment": "Best steak tacos I have ever had in the US! Hands down! I could stop there but I owe it to those who will review comments to make a decision on this place to know that if they forgo eating here, then they will have made a horrible decision. The steak was cooked perfectly and I was given huge portions of it. The lettuce, onions and salsa were fresh and just made the tacos that much better. The corn tortillas were warm and perfect. You will not eat better authentic Mexican food than La Oaxaquena! This trumps the chain tex mex so many Americans like and is anything but tex mex. This is the real deal for real foodies looking for authentic Mexican food. Make it a priority to eat here! Service was great and the restaurant was well maintained.",
   "Name": "Joe L.",
   "Name_url": "https://www.yelp.com/user_details?userid=EcFRK0ZThQolPgXZASeS_Q"
  },
  {
   "Date_Posted": "11/20/2017",
   "Review_Comment": "The food is good and pretty authentic. The prices are reasonable. The atmosphere is more like a fast food restaurant and they will not give you free refills on tea or soda. It's a decent place for lunch.",
   "Name": "Carrie R.",
   "Name_url": "https://www.yelp.com/user_details?userid=ZvCb611OvO0FS1R7axayJw"
  },
  {
   "Date_Posted": "5/18/2017",
   "Review_Comment": "This place actually lived up to the hype! The food was so good! Everything we had was out of this world. We live in Marietta almost 1hr 15 min away it was not only worth the trip - I will be bring my friends here.\nOMG the sauces were so authentic - the Tres Leche WTF!! Get up and come here.",
   "Name": "Norbert C.",
   "Name_url": "https://www.yelp.com/user_details?userid=loL96zaksHCYfGkGWfh5_w"
  },
  {
   "Date_Posted": "9/16/2017",
   "Review_Comment": "One of my boyfriend n I fav spots in Morrow. I recommend the Horchata, steak & chicken quesadilla and the burritos are pretty good as well!",
   "Name": "Stephanie C.",
   "Name_url": "https://www.yelp.com/user_details?userid=1aQoBIyf8aAhBDgyK8c3gg"
  },
  {
   "Date_Posted": "6/11/2017",
   "Review_Comment": "By far the best Mexican restaurant I have ever been to! The pork gordita was in the most delicious corn cake and the beef cheek tacos were out of this world good!\nPrices are extremely good and the menu was packed with so many choices!",
   "Name": "Kate B.",
   "Name_url": "https://www.yelp.com/user_details?userid=WqwWxOWGOap2Pt6pvLDF1A"
  },
  {
   "Date_Posted": "9/20/2017",
   "Review_Comment": "This is my favorite Mexican taqueria since now! It's close from my work! I love the salad bar everything is clean and good cx service. They work as a real team. The menu is very complete!",
   "Name": "Jeniree O.",
   "Name_url": "https://www.yelp.com/user_details?userid=IxtmpEw6WaeN18Bf4N6UgA"
  },
  {
   "Date_Posted": "1/17/2016",
   "Review_Comment": "You know a place is good when their wings and fries are good and they specialize in Mexican food. Wings super crispy. Fries crispy.\nBring you chips and salsa. There is a salsa bar there too.\nCorn Tortillas are thin and fluffy, is that a thing?\nThe Al Pastor (marinated pork) Tacos totally rocked my Boat.\nYou get lime, radishes, and whole grilled green onions to accompany your tacos.\nThe smell of hot corn tortillas, beautifully slightly charred pork, with cilantro and onions. Simple but deliciously decadent.\n10/10 would try everything on the minion.",
   "Name": "Kevin N.",
   "Name_url": "https://www.yelp.com/user_details?userid=mSUJaM8KutmzT8Do86JquA"
  },
  {
   "Date_Posted": "5/10/2017",
   "Review_Comment": "First and foremost we found this place on yelp and it was a last minute lunch decision... Our food took 30 minutes or longer to come out and they wanted to charge us 2.50 to refill the chips. I have never been to a Mexican restaurant and they wanted to charge for the chips??!!! LIke really????? Other than that the food was good and the fresh salsa bar was a plus!! I may give them a second try but this exp really put a bad taste in mouth! .",
   "Name": "Miranda B.",
   "Name_url": "https://www.yelp.com/user_details?userid=CwCCfA5rPfjgD_SMazbr3g"
  },
  {
   "Date_Posted": "9/5/2016\nUpdated review",
   "Review_Comment": "A true legitimate Mexican food place. The menu has a great variety of Mexican food. The tortillas are home made corn tortillas. I recommend a cold glass of horchata.",
   "Name": "Peto F.",
   "Name_url": "https://www.yelp.com/user_details?userid=Ddx2-EioXB_KZQ_nB38Fkg"
  },
  {
   "Date_Posted": "5/17/2017",
   "Review_Comment": "Good food but crazy busy. Expect to wait 30 minutes plus. It's my personal opinion since I actually ate here.",
   "Name": "Mr N.",
   "Name_url": "https://www.yelp.com/user_details?userid=xt6SV8SaELUJusZFiiUdsg"
  },
  {
   "Date_Posted": "1/29/2016",
   "Review_Comment": "This place is ok. Its Mexican food. You cant screw that up can you?\nthe service is always top notch. They are on you quick and take your order fast. The food has always been good. Their 1/2 chicken is good. All the lunch specials that my friends and I have tried have all been very good. the price is also good for the lunch specials.\nSO, the only reason that I dont give this place a 5 star rating is bc its ok. It;s not the greatest place on earth and if you only had one more mexican dish that you could eat, this would not be my final choice. Thats the only reason no 5 star.\nYou wont be sorry eating here. I recommend.",
   "Name": "Eddie R.",
   "Name_url": "https://www.yelp.com/user_details?userid=88YVtATlF3mOTBzU_4zymA"
  },
  {
   "Date_Posted": "4/30/2017",
   "Review_Comment": "Their salsa bar is lit. Their tacos are lit. And it's a all affordable. Clay Co's best little secret",
   "Name": "Kristin B.",
   "Name_url": "https://www.yelp.com/user_details?userid=BdZsh-QEawGsc0jyrrUa7w"
  },
  {
   "Date_Posted": "4/21/2017",
   "Review_Comment": "We have been seating in this restaurant for 30 minutes and still no food and there is just few tables occupied and the waiters are just walking around.",
   "Name": "Saul S.",
   "Name_url": "https://www.yelp.com/user_details?userid=USjLxzh1bEZOkFoO8LttQQ"
  },
  {
   "Date_Posted": "3/7/2017",
   "Review_Comment": "Best most Authentic and delicious Mexican food I've had since moving here from California. Even the Jamaica was bomb! I ordered the flautas and they were hearty and good. Prices are outstanding! The service was great too and fast.",
   "Name": "KHADIJAH J.",
   "Name_url": "https://www.yelp.com/user_details?userid=CGJ6wmVHd76UhBUfWV4ArQ"
  },
  {
   "Date_Posted": "12/12/2016",
   "Review_Comment": "Chicken enchilada with steak made two meals for me. The flavors were to die for. Another day I had La Cubana breakfast sandwich, another 2 meals in one. The orange juice was fresh and delightful. The dessert a Flan made with vanilla was like a creme brulee pie square, a much thicker consistency. The service I received was excellent.",
   "Name": "Sam V.",
   "Name_url": "https://www.yelp.com/user_details?userid=SoVxMPtZq11jgN8vWT1DvA"
  },
  {
   "Date_Posted": "4/26/2016",
   "Review_Comment": "I've traveled throughout Mexico and this is the most authentic Mexican food in Atlanta. The meat is arrechera style, the best and most delicious for carne asada. The guacamole is fresh and there are many types of salsa for every taste. The only negative is that they do not serve cold cerveza. But maybe that's good too because there were many families present when I was there. If you want real authentic Mexican food in Atlanta, come here. You will appreciate the story behind Tacqueria La Oaxaquena also.",
   "Name": "Robert B.",
   "Name_url": "https://www.yelp.com/user_details?userid=J18ol0RI1TuyqGKFZJfh3w"
  },
  {
   "Date_Posted": "4/20/2016",
   "Review_Comment": "Worth the drive from Atlanta!\nService: incredibly polite, courteous, and prompt. Our server was a soft spoken young man who was very sweet and patient with us as we explored their huge menu.\nFood: holy smokes, so good! Husband had the chilaquiles with verde sauce, and I had beef enchiladas with verde sauce. Their verde is flavorful with a heat that builds the more you eat (not stupidly spicy, but you know you're eating legit salsa). I've also had their tlayuda when a friend got take-out. Husband and I agreed that their chilaquiles were better than those of a certain \"mex-tex\" restaurant on the Atlanta beltline. Really darn good!\nDrinks: no alcohol, so plan accordingly if that is important to you.\nThey fill alot of to-go orders, nearly as many as sit-down guests while we were there, so don't be shy.",
   "Name": "Christy B.",
   "Name_url": "https://www.yelp.com/user_details?userid=DxZKXJF6v6oD9-vv1pe-8A"
  },
  {
   "Date_Posted": "8/6/2016",
   "Review_Comment": "First off, VERY AUTHENTIC MEXICAN RESTAURANT. The agua de jamaica was very good. We ordered the Cubana Torta, flautas, and tacos al pastor. Obviously had to try their tacos al pastor. La Cubana Torta will make you full!! It is stuffed. The tacos al pastor were really good. They give you a lot of meat and \"toppings\" and real tortillas. Many places serve dry meat on tough tortillas, but I was content with theirs. And to top it off, they serve chile toreados which was surprising and made me excited since it is too rare that these Mexican restaurants serve chile toreados. Definitely worth visiting if you're looking for an authentic restaurant that serve amazing food and lots of it at a great price.",
   "Name": "Christian M.",
   "Name_url": "https://www.yelp.com/user_details?userid=Nyos_JGg5nQChNb97V0ehQ"
  },
  {
   "Date_Posted": "5/8/2016",
   "Review_Comment": "This place just didn't live up to all the hype. The salsa bar was a nice touch but the food was just ok. They got my husbands order wrong and then his tortillas were a little on the stale side. My chicken enchiladas verde was decent but far from the best I have ever had. Service was also a little unfriendly.",
   "Name": "Shonda W.",
   "Name_url": "https://www.yelp.com/user_details?userid=jleytyKvCxDP9JSjLwhDsw"
  },
  {
   "Date_Posted": "1/10/2017",
   "Review_Comment": "Excellent Enchiladas Verdes. We enjoyed La Cubana, the quesadilla, and the complimentary salsa and chips, but not so much the Menudo. We can't wait to try their tacos and other specialty dishes in the future.",
   "Name": "Joy S.",
   "Name_url": "https://www.yelp.com/user_details?userid=OzDiE5MCxpB1pUn3VlZCWQ"
  },
  {
   "Date_Posted": "8/12/2015",
   "Review_Comment": "Last date: Aug. 8 2015\nI have been to this Mexican restaurant ever since it was a hole-in-the-wall (circa 2003). Back in the days when they would only take cash and they had an old T.V where they would play Mexican novellas. It has now moved to a much larger place and they take cash and now the waitress are bi-lingual.\nI honestly only come here to eat tacos. Tacos de carne asdae, with horchata. The tacos are great, and they have about 10 different salsa's you can top it off with.\nWould I eat here again -- Yup! Is it better then Buford Highway Mexican joints - Yup.\nFood: 4.5 stars\nService: 3.5 star\n-Andy",
   "Name": "Andy S.",
   "Name_url": "https://www.yelp.com/user_details?userid=IhMKAIVDxCyfn3eVaeSqAA"
  },
  {
   "Date_Posted": "12/8/2016",
   "Review_Comment": "I was in the mood for real Mexican food. Awesome customer service. A little slow because of lunchtime. I can't wait to try this street steak taco. No Taco Bell here!",
   "Name": "LaLa L.",
   "Name_url": "https://www.yelp.com/user_details?userid=IhnCbJE6v6mi39Da3jxMsw"
  },
  {
   "Date_Posted": "1/19/2017",
   "Review_Comment": "Tacos are what I always get! My hubby is hooked on them too... Me encanta la carne asada tacos...",
   "Name": "Karla R.",
   "Name_url": "https://www.yelp.com/user_details?userid=m9mzw3croGccDB0KdUwhXw"
  },
  {
   "Date_Posted": "10/21/2016\nUpdated review",
   "Review_Comment": "I had chicken enchiladas in a green sauce with rice and beans. It was okay...it was just a little too spicy. It also came with steak on top which was nice. The rice was good; the beans were okay I just I like my beans refried. My mom had chicken soup...she said the broth had no flavor, they put a chicken leg and breast, chucks of veggies and corn cut in half. She wished they were cut up more.",
   "Name": "Nonah G.",
   "Name_url": "https://www.yelp.com/user_details?userid=KqqRdjZBsrLn8IoxbSC8gQ"
  },
  {
   "Date_Posted": "2/6/2015",
   "Review_Comment": "OK, me being born and raised in Southern California and living in Mexico was feeling good and hopeful about the good reviews..... Wake up Jonesboro, Ga.\nThe food here is OK, semi authentic.\nThe cheese dip was like water, the beans had good flavor, the torta was decent but lacked volume, the taco de lengua should have been served on corn tortillas, and the chicken taco salad was horrible....\nThis is just a fast food joint with high prices for little amount of food and what Mexican restaurant don't serve guacamole? And burritos with no meat?\nDon't waste your time on this place if you want a real Mexican food experience.\nWake up America and quit eating garbage!",
   "Name": "Eric D.",
   "Name_url": "https://www.yelp.com/user_details?userid=9_bfKI-to-dzE9OjaTEGpg"
  },
  {
   "Date_Posted": "10/3/2016",
   "Review_Comment": "I love this place! The food is good and authentic enough if you know what to order. I typically get tacos, tamales, their Mexican pizza, gordas...I guess I've tried many items, but I'm always satisfied. I also love the fresh salsa bar.",
   "Name": "Tuni A.",
   "Name_url": "https://www.yelp.com/user_details?userid=ztFEKdC2S_wxSqPbAkrpWQ"
  },
  {
   "Date_Posted": "1/24/2016",
   "Review_Comment": "Best authentic ethnic Mexican food I've had outside of Mexico ! Loved it ! I would definitely recommend this place! Be careful of the burgundy oil that is fire in a container ! The guacamole was fresh and delicious! I can say anything was bad! Service was great !",
   "Name": "Mark C.",
   "Name_url": "https://www.yelp.com/user_details?userid=TJ41svrgthS9Ru1FAaYFWQ"
  },
  {
   "Date_Posted": "3/24/2016",
   "Review_Comment": "The best authentic Mexican restaurant in town. All of the dishes are great. The only play I would go for real Mexican food. Needs one in locust grove.",
   "Name": "Kimberly M.",
   "Name_url": "https://www.yelp.com/user_details?userid=Nv2kgVWAOuY_0iFsbTLHvg"
  },
  {
   "Date_Posted": "7/30/2016",
   "Review_Comment": "The food was very unsatisfactory not authentic Mexican food. very salty chorizo and poor service. Only good part was the aguas frescas that's it.",
   "Name": "Alexa J.",
   "Name_url": "https://www.yelp.com/user_details?userid=mU2or6_8lu9sFUdBnpOPKg"
  },
  {
   "Date_Posted": "1/4/2017",
   "Review_Comment": "Extremely poor service. We came in about the same time as 2 other parties. Both of those tables got their food way before us. In addition to the long wait we never got drink refills and at the end of our meal I asked for a couple boxes and we only were brought 1. The waitress was not attentive at all. Maybe the waitress was racist as the tables that were taken care of fast and well, the customers were Latino.",
   "Name": "Angela J.",
   "Name_url": "https://www.yelp.com/user_details?userid=4aBOhHjGvf5kA68BG-VDTg"
  },
  {
   "Date_Posted": "6/10/2016",
   "Review_Comment": "I never would have expected phenomenal Mexican this far out of Atlanta (even Atlanta was a Mexican food desert until recently), due to the likelihood that the customer base wants something that more resembles a taco from Old El Paso then from a street corner in Oaxaca. I WAS WRONG! Taqueria La Oaxaquena was amazing and true to what I've experienced in the food Mecca of Mexico, Oaxaca. I can recommend this humble but delicious Oaxaca restaurant enough. The food is worth the ride, even if you only wanted to get their yummy salsa!",
   "Name": "S W.",
   "Name_url": "https://www.yelp.com/user_details?userid=9cllmBzktV9mJct-dsNzCg"
  },
  {
   "Date_Posted": "1/15/2016",
   "Review_Comment": "Wow their menu is extensive! I am trying tacos including buche- pork stomach excellent cabeza- cows cheek excellent- lengua-beef tongue excellent mole-chicken in mole sauce pretty good but I'll pass next time. Always wanted to taste mole though. Lastly pastor sopes- marinated pork wonderful! The meat is the most tender melt in your mouth full of flavor making my mouth happy thing of bliss! I wish I could have given five stars because the food is definitely worth it but the restaurant is cold, I have my coat on. My food is mouth watering but I'm daydreaming about getting back to my car and blasting the heater. My waiter didn't speak English. Yes it's a Mexican restaurant but I'm an American and I had questions about the menu. A waitress mopped the entire area that myself and five other couples were eating at and her mop bucket hit the table by my food. Cleanliness that's great...while I'm eating next to my food...I'll pass.",
   "Name": "Kimberly N.",
   "Name_url": "https://www.yelp.com/user_details?userid=Q98mdmo_U1LtWJeRiOJQfw"
  },
  {
   "Date_Posted": "8/27/2016",
   "Review_Comment": "This is a solid Mexican experience. ATL has no shortage of great Mexican food. This is more \"authentic\" I guess one could say. Major plus points: salsa bar, entree list and service.",
   "Name": "Ryan M.",
   "Name_url": "https://www.yelp.com/user_details?userid=gzzKJTsZHC497nc03IlHVA"
  },
  {
   "Date_Posted": "9/17/2016",
   "Review_Comment": "Seven dollars. Yes, 3 filling tacos (al pastor, carnita, and chicken mole) for 7 dollars. Each one was so good i could have had a plate with just that kind...but why limit yourself? Fresh, tasty, and the tortillas were heated on a kitchen grill before being filled. Fast service, clean surroundings, and did I mention price? I'll be going back tonight!",
   "Name": "Sally H.",
   "Name_url": "https://www.yelp.com/user_details?userid=WIDh6WFxYgdrXsl21pu2Bw"
  },
  {
   "Date_Posted": "8/4/2016",
   "Review_Comment": "I dont know how to pronounce it. But i do know how to get there! Great food. Friendly service. Personally, I love it!",
   "Name": "Lizzy M.",
   "Name_url": "https://www.yelp.com/user_details?userid=wqDtUk-s1GVyczdb7HmpXw"
  },
  {
   "Date_Posted": "7/26/2016",
   "Review_Comment": "Had a very good meal here. Can't believe how many pretty good Mexican places Atlanta has, who knew? Meal was good and service was super nice. Only reason I could not rate it higher was I ate at another local place and the food was better and much cheaper but I would still suggest this it will not disappoint.",
   "Name": "Truck C.",
   "Name_url": "https://www.yelp.com/user_details?userid=t_K5dl7xxTIGRWu5OvrvRA"
  },
  {
   "Date_Posted": "2/26/2017",
   "Review_Comment": "The service, food and atmosphere was very laid back. The chicken and steak tacos were very good. My wife had a medium chicken burrito which was enough for 2 people. The burrito was grilled which took the taste to a new level. The salsa bar was a unique twist to this authentic Mexican experience. Also, the bathrooms were the cleanest we have experience in a long time. All of this at 7:30 on a Friday night.",
   "Name": "Ronnie W.",
   "Name_url": "https://www.yelp.com/user_details?userid=oAzNQOfFLwJ0LM_7ZyWBiw"
  },
  {
   "Date_Posted": "6/28/2014",
   "Review_Comment": "Fresh, delicious Mexican food, minutes from I-75 and Southlake Mall. Portions are big, prices are reasonable, and service was great. Restaurant is immaculate, and staff were ever-cleaning and replacing items on the (free!) salsa bar.\nAgua frescas are delicious & inexpensive--under $3 for a 32-ounce cup of refreshing, fruity goodness. And it's only $1 for a 32-ounce refill, crazy. Milkshakes are excellent--especially mango--and taste more like fruit than sugar (a good thing).\nChicken tlayuda ($11.99) was good and HUGE. Beans, chicken, lettuce, cheese, avocado, and jalapenos layered over a crispy (or you can select grilled), thin tortilla. I shared and still couldn't finish the dish.\nChicken flautas were also very tasty; 5 served with rice & beans, and garnished with lettuce, lots of crumbled cheese, roasted jalapeno, and avocado for $8.25. Chicken enchiladas ($10.50) were good, 4 w/choice of red or green sauce, rice, beans, and salad. When the plate arrived, I thought it was incorrect, but apparently it's also served with a hunk of steak on top of the enchiladas. Unexpected but tasty.\nThe flan was incredible, best I've ever had. Rich but not overly so, nice bite but not eggy. $5 for a large brick of it, garnished with fruit. HIghly recommend this restaurant for great, authentic Mexican.",
   "Name": "Emily T.",
   "Name_url": "https://www.yelp.com/user_details?userid=xjMuDgk1iUnwahIW5xc_3g"
  },
  {
   "Date_Posted": "5/26/2016",
   "Review_Comment": "The flavors...OMG. There is truly NOTHING like authentic Mexican food. The Tlayuda appetizer fried with steak was insanely delicious! The flautas, rice, and beans were to die for, and hubby raved about the beef tongue Americano taco, and his two chorizo Oaxaqueña tacos. Excellent service and very clean interior. Worth the drive from west Atlanta!",
   "Name": "Tami H.",
   "Name_url": "https://www.yelp.com/user_details?userid=bKE_A_v5zehSsoSh7yIfVA"
  },
  {
   "Date_Posted": "6/14/2016",
   "Review_Comment": "I've actually been coming to this place for a number of years and it's always been consistently delicious. The best part of today's visit is the 100 on the health rating!\nI'm stuck between 5 and 4 stars here. Tacos are excellent and well priced. Love the al pastor and the tender tamales. No beer or seafood, which is a dud. Salsa bar is great. Especially the avocado/guacamole salsa.\nService was friendly and efficient.",
   "Name": "Chas P.",
   "Name_url": "https://www.yelp.com/user_details?userid=RQL78mcxgaYG42a0hv4y6g"
  },
  {
   "Date_Posted": "6/22/2016",
   "Review_Comment": "Great authentic Mexican food. If your from California like myself you will be extremely satisfied",
   "Name": "Natai D.",
   "Name_url": "https://www.yelp.com/user_details?userid=bASQjuN7t7FoVTG23Bb_kg"
  },
  {
   "Date_Posted": "6/20/2015",
   "Review_Comment": "\"Best Mexican food in Ga.\"\nI live in Southern California and been working in Ga. off and on for the past 3 years. We stumbled across this place and it reminded us of home.",
   "Name": "Arturo D.",
   "Name_url": "https://www.yelp.com/user_details?userid=8tuElYuaNiSU9fjs1c9nwg"
  },
  {
   "Date_Posted": "4/24/2014",
   "Review_Comment": "So I'm from out of town and in town to ship my car to Hawaii, stayed at the Hampton Inn and opened Up my Yelp app for a place to eat near me...\nThe reviews led me to this restaurant but I'm not gonna lie when we pulled up in the spot we weren't sure about going in...cause of the location. But we're not snooty so we have it a shot.\nSuper happy we decided to eat here. The waitress and staff were friendly and service was very prompt. Their menu offered a variety of authentic Mexican dishes. Their green and red enchiladas were amazing. Kids loved the junior tacos with rice and beans. Salads were complete with avocado slices and their fresh fruit juices were delicious. Prices were very reasonable.\nWhile we were there it got busier and a blend of people were coming in to dine Including policemen/detectives.\nThe seating wasn't the most comfortable but the place was immaculately clean. I would definitely recommend this place and would stop by again when in town. Overall hella good Mexican food",
   "Name": "Bruno S.",
   "Name_url": "https://www.yelp.com/user_details?userid=sICr3-csqXQhFmMY6bki6g"
  },
  {
   "Date_Posted": "6/29/2014",
   "Review_Comment": "Portions are huge and it's the most authentic Mexican food I've seen in the Atlanta area in a long while. There is a salsa bar where you can load up on whatever salsa you want.\nThe upside? They have lots of chips and lots of salsa. The steak nachos I got were AWESOME! I would strongly recommend it. It's a great value, comes with cheese, steak, chips, and a bunch of other sides on top of it (and best of all, no sour cream that I don't like).\nDuring the lunch hour, it takes a bit of a hand waiving to get them to come over to refill our drinks and such, but overall, I was happy with the service, food quality, etc. The one downside was the ambiance of the place. It seemed a bit run down. Other than that, I'd definitely be back there because the value of the meal (not super expensive and great food quality!)",
   "Name": "Peter K.",
   "Name_url": "https://www.yelp.com/user_details?userid=W-WTs-vofJqK_-rDUUJJlA"
  },
  {
   "Date_Posted": "1/6/2015",
   "Review_Comment": "Hmm....grilled cactus, what an experience. In all my years of living in NYC and eating at Mexican restaurants not once have I ever seen it offered on any menu. Beware if you order the large soda it's a monstrous 32oz cup that is more than enough for 4 people...lol.\nThe prices are downright reasonable and the quality of the food is top notch, very tasty and authentic.",
   "Name": "Jonathan S.",
   "Name_url": "https://www.yelp.com/user_details?userid=bs84MH-iEGkevfH2T-L95Q"
  },
  {
   "Date_Posted": "9/26/2015",
   "Review_Comment": "Great authentic food. Had a quesadilla, which was delicious and my husband had cheese enchiladas. He actually didn't clean his plate (which us unusual) because it was too spicy.\nLots of other patrons were having soup, so next time I'm going to try the seafood soup. Oh and I wish I had seen the desserts before I had lunch because the flan looked amazing!!!!",
   "Name": "Maribel M.",
   "Name_url": "https://www.yelp.com/user_details?userid=msQnFEx-6uxy_vz2GCX5vQ"
  },
  {
   "Date_Posted": "5/5/2014",
   "Review_Comment": "I HIGHLY recommend this place. The food is DELICIOUS. It's authentic Mexican food. Not the fake mozzarella cheese they use, but queso fresco. The parking lot was full but the restaurant is pretty big. Please be aware the portions are big. They are very generous. I made the mistake of ordering to much food.\nThe staff was friendly and outgoing. It's very clean and the prices are decent. Their desert menu looked really good. I was sad that I didn't get to try it.\nIf you are in the area you must go!",
   "Name": "Eunice S.",
   "Name_url": "https://www.yelp.com/user_details?userid=-Xji1yPuwcYcrHzwdaT8vg"
  },
  {
   "Date_Posted": "3/6/2016",
   "Review_Comment": "I love their steak burrito. The peppers are so good. I love their guacamole that they leave out too.",
   "Name": "Kay B.",
   "Name_url": "https://www.yelp.com/user_details?userid=d830qGyRUxLUdM5tppe2Qw"
  },
  {
   "Date_Posted": "3/4/2016",
   "Review_Comment": "Wonderful authentic Mexican food. Clean great homemade salsa bar. The flanges the best I have ever had. They even have wings. The garlic pepper wings are a must try",
   "Name": "Donalda M.",
   "Name_url": "https://www.yelp.com/user_details?userid=PAuYnhPF0JIfBpYwkMZulw"
  },
  {
   "Date_Posted": "12/20/2015",
   "Review_Comment": "Very good Mexican place on the southside of Atlanta. Tacos are authentic and fresh. Staff is always friendly and service is on point.",
   "Name": "Gunner P.",
   "Name_url": "https://www.yelp.com/user_details?userid=F3daV3x2L5RK8eiusiRa2Q"
  },
  {
   "Date_Posted": "8/17/2013",
   "Review_Comment": "The taco thing has really taken off the last several years. I've been here, I've been there....and I as beginning to think that maybe I'm just not a taco person. And then I found this place. I don't often travel OTP, but at the insistence of a close friend, I trekked down to Jonesboro to try this place out. First, I'm struck that there are Hispanic people eating here. That's not very common at the Tex-Mex places in town. It's a sign, La Oaxauena is the real deal. The tacos were quite tasty, and the price point was just where it should be. The tacos are big. I ordered 3, and took 1.5 of them home. The barbacoa was delightful, it had that hint of gaminess you expect from goat. The beef tongue was a surprise favorite. The meat was tender and delicious. My third taco was chorizo, lovely all around.\nThe salsa bar is a sight to behold. Clean, and with a bevy of salsa choices to top your taco. To wash it all down, a (huge) cup of pina aguas frescas. Crisp and refreshing. All it was missing was a bit of rum. The one downside, this place doesn't serve booze. All in all though, a superb meal and well worth the trip. I and my dining companions had 11 tacos and 2 big cups of aguas frescas and spent under 30 bucks. The waitstaff were very polite to us. They were much friendlier when they found we had a Spanish speaker in the group. But the service was just fine before they knew that too.\nIf you like tacos, or if you don't, check this place out.",
   "Name": "Obadiah S.",
   "Name_url": "https://www.yelp.com/user_details?userid=OYKuUkXARtrPr1F9v5mkEQ"
  },
  {
   "Date_Posted": "2/25/2016",
   "Review_Comment": "The food was OK. I expected alot from the reviews but when I ordered the food was just mediocre and the restaurant wasn't the cleanest.",
   "Name": "Mika R.",
   "Name_url": "https://www.yelp.com/user_details?userid=9WEufOrODZdO5y7dFFI2rQ"
  },
  {
   "Date_Posted": "7/17/2011",
   "Review_Comment": "If you had to pronounce the name of this restaurant to gain access, many would be turned away. Luckily, they welcome all, and you should definitely come try this place out.\nIt's much more spacious than it looks, with rooms to the left and right of the central area. Ask for their lunch menu if they don't offer it (or if it's not dinner time) because they have combos for $6 and under.\nBefore I get into what I ordered, let me bring up the salsa bar, which has you originally asking um, is this free?? YES! They hit you with multiple salsas (the habanero salsa is no joke, you've been warned) and a really great cactus salad. Try it!\nI ordered the steak quesadilla, which is already pretty big and very tasty on its own, but it came with a side of rice, side of refried beans and a large soda for right at $6. VERY tasty!\nI noticed someone mentioned their burritos, and I saw one of the super burritos being taken to an unsuspecting orderer...that thing looked like foot long sub and a half. HUGE.....so yea, i'll be ordering it next :)\nI will say if you're at a time crunch, you may want to let them know ahead of time, because we didn't get our food until 35, 40 minutes into an hr lunch. Also, chips are not on the house, like other restaurants, but considering that's half the calories, I don't mind not having them sat in front of me!\nFantastic restaurant, which provides both an authentic and american take on their dishes. Very tasty place, i'll be back",
   "Name": "Jamarcus T.",
   "Name_url": "https://www.yelp.com/user_details?userid=K8VSrOOCdXS9VX5S66W4GQ"
  },
  {
   "Date_Posted": "7/11/2013\nUpdated review",
   "Review_Comment": "It pains me to see this menu has been updated with items like chicken wings and cheese-steak sandwiches to keep the average 'Murican interested. Fortunately, the good stuff is still on the menu. Since my last write-up, I have indeed had a tlayuda. And it was everything I expected it to be. (Except bigger.) Next time--the sopas, for sure. Holler if you're coming with.",
   "Name": "Mick D.",
   "Name_url": "https://www.yelp.com/user_details?userid=ypYEK8nw6N71jVrQBv09Ag"
  },
  {
   "Date_Posted": "1/1/2015",
   "Review_Comment": "Just found out that this place is right up\nthe street from me. My family loves authentic Mexican food. Josh, the wonderful server makes your dinner or lunch very pleasant. He is very informative about the entire menu. The service is fast and the food is cooked fresh to order.\nYou got to try the pork tamales. They are the best on my personal top 10 list. The only con about this restaurant is, that there is No alcohol. But I just grab a bite here and go by the package store for a cold Corona.",
   "Name": "Tracey H.",
   "Name_url": "https://www.yelp.com/user_details?userid=hSiF0x-vR7xw1zVxk-iyzQ"
  },
  {
   "Date_Posted": "5/30/2015",
   "Review_Comment": "We just needed a Mexican place so we came here , it was full of Mexicans so you know its good, prices are really good and service was on point a nice lady who made sure we where doing good , I will definitely come back here and will recommend for friends",
   "Name": "E E.",
   "Name_url": "https://www.yelp.com/user_details?userid=quRY-l9-PNdciy__lQmwSA"
  },
  {
   "Date_Posted": "8/10/2016",
   "Review_Comment": "Very good food. I travel an d look for good Mexican places to eat. I will be back here.",
   "Name": "George F.",
   "Name_url": "https://www.yelp.com/user_details?userid=izaBcN0S6dFbblb6xUv7UQ"
  },
  {
   "Date_Posted": "3/10/2015",
   "Review_Comment": "Very authentic Mexican place! I would prob give them 4.5 stars because I didn't like their guacamole. It was smooth and I usually like mine chunky but that's personal preference. Tortillas are made in house, flautist are awesome and I don't know what's in their salsa but I'd buy a whole bottle!",
   "Name": "Drew V.",
   "Name_url": "https://www.yelp.com/user_details?userid=cB069OCdDGMQCr7avFaPfw"
  },
  {
   "Date_Posted": "1/17/2016",
   "Review_Comment": "My girl is mexican so she is my go to gal for authentic Mexican food!! This place is the only place that she has cosigned authentic mexican food. Everything from the dishes right down to the sauces and salsas. We love this place! The prices are average and reasonable and they serve a plethora of authentic mexican dishes. I'm keen on going for what I'm used to like nachos and tacos only because that's what I thought was typical mexican food. They do have a portion of the menu that is \"americanized\" but broaden your mind and you will find that this place really tops it when it comes to mexican food. Service is good but majority of the staff speaks Spanish so conversation will be limited but as long as you know how to express what you want on the menu your in luck. I recommend the tamales, nachos, tacos on corn tortillas...not flour.",
   "Name": "Desmond M.",
   "Name_url": "https://www.yelp.com/user_details?userid=_FFCNBG3d_JlM5QGZUlDKg"
  },
  {
   "Date_Posted": "3/9/2016",
   "Review_Comment": "The service was really nice although some of our food came out wrong.....The salsa bar was different (in a good way) and they gave us lots of chips which was good because our food took awhile to come out. Once it did, my chicken fajita quesadilla was small but tasty. Everyone in our party thought their food good. Not amazing or out of this world, just good food. We'll probably try something else next time.",
   "Name": "Mark L.",
   "Name_url": "https://www.yelp.com/user_details?userid=dQfAN1D14ZEpuwqj1USjKA"
  },
  {
   "Date_Posted": "7/8/2016",
   "Review_Comment": "This is some of the best Mexican food I've encountered outside the southwest. We stumbled upon the place on a road trip. I was most impressed with the fresh salsa bar and the tacos. My wife got the sopas and raved about them. We will stop again next time we pas through town.",
   "Name": "Jeff G.",
   "Name_url": "https://www.yelp.com/user_details?userid=nvHpjlnZBp0VdgRqs7NO8w"
  },
  {
   "Date_Posted": "10/14/2015",
   "Review_Comment": "When you first see the place you think, \"can't be much\" but what were you thinking!! A truly good, fresh-made Mexican food place in south Atlanta. Everything seemed to be made right here...tortillas, salsa, guacamole, tamales, and the list goes on! I ordered what I thought was an average size tostada-type entree called the Tladuya. That's probably not how it's spelled, but just ask for the \"tostada thing the size of a large pizza!\" Your choice of chicken, beef or pork. I had chicken. Excellent. Comes with refried beans slathered on the fried or grilled tortilla along with lettuce, tomatoes, long-sliced jalapeños, radishes, avocado slices and two different cheeses, including one that looks like pulled string cheese. The tamales are huge, again with your choice of meat. The salsas range from a mild to \"take-the-wallpaper-off-the-wall\" HOT. If you still have room after eating something like this, the desserts looked awesome and again, likely made right here. I'll definitely be back again!!",
   "Name": "Michael A.",
   "Name_url": "https://www.yelp.com/user_details?userid=AbVgoxGyGoAWWIb4LdGsww"
  },
  {
   "Date_Posted": "8/17/2015",
   "Review_Comment": "Wow. My husband and I were in the area, and Mexican sounded good, so we thought we would stop by. The parking lot was full, but we had no wait. The salsa bar had a lot of variety. Our favorite was the guacamole sauce and pico! We ordered steak, pork, and goat tacos as well as the chicken nachos. We had to wait a little while for our food, but it was worth the wait! Next time, I think we will just go for the tacos. The nachos were good, but the tacos stole the show! Authentic and delicious. My only real complaint is that our table was pretty rocky.",
   "Name": "Elise P.",
   "Name_url": "https://www.yelp.com/user_details?userid=tqwCGQG_r5KaAiYF1DQNnQ"
  },
  {
   "Date_Posted": "6/7/2015",
   "Review_Comment": "Sweet Jesus! After living in Atlanta for over 16 years I have finally located the Best Mexican Food in the City! Being from Los Angeles, CA eating Mexican Food is second nature. You practically grow up on it. So moving to Atlanta you are constantly chasing the So Cal High of Mexican Food. My GF and I felt like getting Mexican Wasted and wanted to try something new, so we hit our trusty Yelp App and located this spot. At first we were slightly disappointed that no liquor was served, but that got me to thinking if they aren't serving liquor THIS IS A SPOT. I immediately got excited because that means the food is on another level. We walked in and the placed was packed with families and working class folks. At this point I'm getting way too excited. We sat down and the menu was Bananas- all the good Mexican treats. We went crazy: 2 tamales, 2 sopes, a gordita, and a taco! I was in Mexican food heaven.\nThis will be the only spot that I will eat Mexican food in Atlanta now.",
   "Name": "Mike B.",
   "Name_url": "https://www.yelp.com/user_details?userid=QLTRaK92CWXDrZwbI46KOg"
  },
  {
   "Date_Posted": "12/17/2015",
   "Review_Comment": "Good tacos and beet juice.--this is a hard place for vegetarians or vegans but the staff were friendly, the food was very rich/cheesy.",
   "Name": "Monica S.",
   "Name_url": "https://www.yelp.com/user_details?userid=-WGIh3Tf_9ulKFIBXIt24w"
  },
  {
   "Date_Posted": "9/21/2015",
   "Review_Comment": "I have never had authentic Mexican food, but if I were to imagine what it was like this would be it, I will definitely be frequenting this establishment",
   "Name": "Ned H.",
   "Name_url": "https://www.yelp.com/user_details?userid=zwhx1CXW_UrSIxxNIvCIEw"
  },
  {
   "Date_Posted": "8/8/2013",
   "Review_Comment": "The flavor is good at the place, came here looking for some good tacos! They deliver. The tortillas are made in house so they are nice and fresh. The meat was a bit greasy for my liking but it had good flavor. I got lengua, tripa and buche. The Tacos are really big. (I like my Mexican tacos to be little that u can eat in two bites like the ones you get in Mexico, but on this side of the border is hard to get a small taco.)\nThe salsa bar was very good especially the guacamole salsa it really is good with the tacos.\nVisit this place because it's good and try the fresh juice, it's good for ya and it really is a treat, I had orange, carrot and beets, yum!\nEnjoy!",
   "Name": "Brenda L.",
   "Name_url": "https://www.yelp.com/user_details?userid=FTogxubLZgEfj7GGYnk6cA"
  },
  {
   "Date_Posted": "5/28/2016",
   "Review_Comment": "the mole is excellent but everything else we had was mediocre. very disappointing after reading so many positive reviews.",
   "Name": "Lea M.",
   "Name_url": "https://www.yelp.com/user_details?userid=Kqc0-8I1oMODskaEirCrfQ"
  },
  {
   "Date_Posted": "1/25/2016",
   "Review_Comment": "Favorite place to eat. Period. Pico and quac is free. Food is authentic and service is decent.",
   "Name": "Christin C.",
   "Name_url": "https://www.yelp.com/user_details?userid=bIKbFaY4V945-WFp1LraOg"
  },
  {
   "Date_Posted": "9/2/2015",
   "Review_Comment": "their sopas were bomb! lol. i love how they have sooooo many sauces for you to choose from. simple as this... it's a pretty authentic mexican spot...def go check it out",
   "Name": "Suzanne W.",
   "Name_url": "https://www.yelp.com/user_details?userid=8t9eaoP7KR-vZcuILg0mEg"
  },
  {
   "Date_Posted": "12/21/2015",
   "Review_Comment": "Absolutely wonderful. Great food and even better service. I saw so many things that I must try. In order to do so, I will happily return as many times as it takes.",
   "Name": "J T.",
   "Name_url": "https://www.yelp.com/user_details?userid=MT3T8Bi1CN5cvUeRA2DL7A"
  },
  {
   "Date_Posted": "4/14/2013",
   "Review_Comment": "Taquería La Oaxaqueña: Two Words...THE BEST\nThe restaurant features the common fare of Oaxaqueña, in Mexico.\nIt's a very casual atmosphere, and most gringos can expect to be the only one on site. During my visit, we had the Oaxaca Tlayuda(Open-Faced Tortilla Pie), and Tamales.\nBoth dishes were fresh, with great flavor (region uses more garlic, ect). Along with our dishes, we enjoyed the SUPER FRESH salsa bar. I've had my share of Mexican food here in the states, and have been impressed with a few. I proclaim that TLO is my most highly rated and all others rated to this point are a distant second.\nI strongly suggest any GA residents or visitors/travelers not to pass on the chance to enjoy REAL Mexican fare...delicious with great service on site. Awesome food worth 4.5 stars for taste alone...and I slept on this rating before awarding...\nAlso, they've got MTV Latino on Dish...so it's a party:)\nDon't worry, they also cater to English-Speaking patrons...",
   "Name": "Wesley S.",
   "Name_url": "https://www.yelp.com/user_details?userid=Fcek-5HR46P6udHWZQls5w"
  },
  {
   "Date_Posted": "10/9/2014",
   "Review_Comment": "This is easily the best Mexican food I've ever had. I can't imagine there's anything better in the southeast US.\nThis is real, authentic Mexican food...not the Americanized version of Mexican restaurants that are so prevalent around here. (Not that there's anything wrong with those...)\nI wish this place were closer to home...we would be regulars there, for sure.",
   "Name": "Ron D.",
   "Name_url": "https://www.yelp.com/user_details?userid=LTi1xFIdJpNma1Lv6TmxmA"
  },
  {
   "Date_Posted": "1/2/2013",
   "Review_Comment": "I've been going to Taquería La Oaxaqueña for a while now, especially because it's in my side of town. But I had to do a review and talk about how I'm SO HAPPY that Taquería La Oaxaqueña is getting the props they deserve. I was reading an article of Atlanta's Best magazine and to my excitement saw them on the \"50 Best Restaurants.\"\nYes, for a lot of people it is VERY out of the way. But trust me, this is authentic as it gets and it's AMAZING food with humble service.\nI usually get a hurache, which is made of masa ...similar in the resemblance of a sandal, that's where the name \"huraches\" came from. It's fried and topped with anything from steak, pork, or even lengua. (tongue) After that, there's various toppings and plenty of queso fresco on top.\nThey also have a salsa bar, that you are free to wander about and try.\nLast, try the fresh juices they offer! The aqua de melon (cantaloupe water) is so refreshing.\nIf you want authentic Mexican food, you need to try this place out!\nOnly downfall is, the language barrier can sometimes be a little tricky, but they're really nice about it.",
   "Name": "Catherine N.",
   "Name_url": "https://www.yelp.com/user_details?userid=qpAl6spIukX4Byrk4n4LGw"
  },
  {
   "Date_Posted": "10/6/2015",
   "Review_Comment": "Authentic great tasting Mexican food. The staff was very courteous and polite. I will return.",
   "Name": "Shey C.",
   "Name_url": "https://www.yelp.com/user_details?userid=p2Awp9kAm4Aio0VpmagsIA"
  },
  {
   "Date_Posted": "9/23/2014",
   "Review_Comment": "Basically the definition of a \"hidden gem\": inexpensive, tasty, good service, but in a run-down area and very basic furnishings.\nThey are very kid friendly here, almost to a fault, so if you are looking for a quiet, romantic get-away, this isn't it.",
   "Name": "Josh M.",
   "Name_url": "https://www.yelp.com/user_details?userid=kF-euiNSk8OGWg2iQDUXpg"
  },
  {
   "Date_Posted": "6/6/2016",
   "Review_Comment": "What a great find! The beef chipotle burrito I got was fantastic! Beans are great too! Family got American tacos that looked great too. Salsa was delicious and the service was quick! Really good spot.",
   "Name": "Jeff M.",
   "Name_url": "https://www.yelp.com/user_details?userid=dmJOAcxtG-HNC0bnrC0eEw"
  },
  {
   "Date_Posted": "5/5/2015",
   "Review_Comment": "My Favorite spot...SOOOO GOOD!!!!!! Love the customer service and fresh food. I always get the taco salad, so fulfilling. Love Beet smoothie. I can eat here each week. Family friendly. Never tried breakfast but heard it is delightful too! Enjoy!!",
   "Name": "Mmaat N.",
   "Name_url": "https://www.yelp.com/user_details?userid=-y-9iGTz6AgD_Huk-180xw"
  },
  {
   "Date_Posted": "8/28/2015",
   "Review_Comment": "I wouldn't say the best in the city but this was definitely the most authentic Mexican restaurant I've been to in GA. With items such as cow cheek and pork stomach tacos on the menu, I would suggest trying this restaurant at least once. The staff was friendly, and the food was good. I kept it simple and had steak quesadillas. However I was a little disappointed they do not serve alcohol.",
   "Name": "Bre B.",
   "Name_url": "https://www.yelp.com/user_details?userid=nBwdmkNrIUtkm7qO7pzUEQ"
  },
  {
   "Date_Posted": "11/29/2015",
   "Review_Comment": "Best Mexican restaurant in the Atlanta Metro area FOR SURE, HANDS DOWN! Very authentic, very home-y. Prices are reasonable, I haven't been disappointed yet.",
   "Name": "Loyda Z.",
   "Name_url": "https://www.yelp.com/user_details?userid=ARAVXb3jUG1JwN4hrPTUEw"
  },
  {
   "Date_Posted": "11/28/2015",
   "Review_Comment": "Out of all the entrees I ordered To-go for my coworkers and I, they forgot mine. When I called to let them know they told me I never ordered that. Even though I asked the server what came on and with dish and continued to tell him I'd like to order it. Unfortunately they didn't give me my receipt to go and show them. Wish they could have fixed the issue, not just a \"perdon, que tenga buen dia.\" Had to settle for McDonald's, at least they put everything in the bag.",
   "Name": "Juan M.",
   "Name_url": "https://www.yelp.com/user_details?userid=2bR8kXc28jpsHhZbmMTiJw"
  },
  {
   "Date_Posted": "7/10/2014",
   "Review_Comment": "I had a weird lunch craving for tacos, and I normally get them from don pedro in Duluth where I am usually at. This time however, I was down south for a bit to see my parents so I yelped what was in the area for good mexican tacos. This little gem popped up, and I read through a lot of the reviews and was pretty open to try it for lunch. The menu was pretty massive in selections, it was so much I wouldn't even remember what was all on there. I do agree with everyone about the portions that they serve here. Since I am usually eye hungry, I would have ordered 4 tacos, I'm glad I played it safe with 2 because they are pretty great in size. I got the 2 carne asada tacos and had the sauces from the salsa bar to eat with it. They even offer guacamole at the salsa bar!! I also ordered 1 chicken tamale with the verde sauce just to see what tamales were. They were really good. As you can tell, I barely eat mexican food but tacos. If my stomach was that huge in capacity, I wouldn't mind trying the different entrees that were offered, it is just way to much food, and I don't like taking food to-go. Maybe one day when i'm in the area again I'll share it with someone. The prices were really good, and service was sweet. They also have lunch specials here, but like I said the menu was to big I was having a headache reading through everything since I was to hungry. I do find it pretty weird how there are options like wings, and fries on the menu..never ever going to try that though. They also start you off with complimentary fresh hot chips and salsa which were pretty fantastic! Great food here, and sadly I'm pretty far away from it.",
   "Name": "Tran N.",
   "Name_url": "https://www.yelp.com/user_details?userid=kebeWeGNfceOQvbQBP5Cdw"
  },
  {
   "Date_Posted": "5/7/2014",
   "Review_Comment": "Best AUTHENTIC Mexican restaurant in town besides the 24-Hour Mexican restaurant on Old Dixie Road.\nThe staff is very friendly and sweet. The food is amazing! I usually go with my boyfriend and he sometimes order me whatever he recommends is good. (He's Mexican and him and his family goes there way more than I do.) Whatever he gets for me is usually very delicious.\nThey have a salad/spice bar which is very convenient. Other Mexican (or non-authentic Mexican) restaurants don't have a salad/spice bar. I would have to tell the waiter/waitress for extra spices and it would take forever and a day for them to bring it back out, so the salad/spice bar is a thumbs up!\nI love their steak tacos the most! (I know, typical order.) It's so good!",
   "Name": "Rosie N.",
   "Name_url": "https://www.yelp.com/user_details?userid=8joawaF7HeznfCXf4iPQAg"
  },
  {
   "Date_Posted": "9/29/2012",
   "Review_Comment": "Was told this was a really good place for authentic Latin food.\nOne of the things that stood out to me was the huge salsa bar that they have here.\nI just ordered a beef salad because you know...I'm paleo. It was decent and it didn't cost much because it was a $6.99 lunch special. I think they have this as a daily special.\nThe service however was bad. We had to get the server's attention several times and they got our food order wrong.",
   "Name": "Tom C.",
   "Name_url": "https://www.yelp.com/user_details?userid=KcywkJ6WV1Rgb3CaVZ6gow"
  },
  {
   "Date_Posted": "2/24/2015",
   "Review_Comment": "I have the distinct advantage of having my in law family and spouse who are from Oaxaca, Mexico (oh goodness, if you haven't been there, this is an awesome vacation destination and is absolutely beautiful). I visited there a few years ago since my wife's great, great grandmother was turning 100 years old. We had a huge celebration, peppered with authentic Oaxacan food and it was amazing). This restaurant, foodwise, transported me back to this city. It is in southern Mexico, nestled in the mountainous regions and is lush with fertile soils. The local market was endless and often we went to get our groceries. First thing I loved about this place was the \"all you can eat\" salsa bar. You can get a variety of salsas from mild to spicy, pico de gallo, nopales (cactus) and even pickled carrots!! That is just the start. By far my favorite was the clayuda (if you don't know it is misspelled in the menu! Lol). This is a huge \"mexican pizza\", a tortilla (corn or flour) topped with the meat of your choices (you can have more that one), tomatoes, lettuce, grilled jalapenos and authentic Oaxacan mexican cheese. I was instantly reminded of a middle aged Mexican women in the market street of downtown Oaxaca who had about 50 of the clayuda shells on her head in precarious balance, all the while belting out a nasal retort: \"Clayudas....Clayudas aqui!! Yes I said it, AUTHENTIC! Like many different places in Mexico, the cuisine varies from region to region so anyone suggesting that this is not an \"authentic\" mexican restaurant is only saying so because their experience is not Oaxacan! The portions are HUGE---I mean GINORMOUS!! Two to three servings per person!! I also tried the beef caldo (soup) which was invigorating on a cold day. The perfect balance of guajillo chillis in the soup base was comforting. I highly recommend you try the braised/stewed goat meat dinner as well. The depth of flavors they achieved was notable and I found myself eating this a little slow to enjoy it more. This restaurant was filled with children too. It was interesting to see the facial expressions on my 7 mo old as she \"people watched\". I could tell she wanted to try everything (she is really not picky!) and I will bring her back when she is old enough. I usually do not venture forth into Jonesboro but if you are in the area, definately stop to eat here; and be prepared to box up the leftovers!!",
   "Name": "Adil A.",
   "Name_url": "https://www.yelp.com/user_details?userid=jSrgHY_oaxExAZgBJtxSfA"
  },
  {
   "Date_Posted": "4/15/2015",
   "Review_Comment": "Very disappointed. Bad service, bland food, messed up orders.. nothing positive to say.",
   "Name": "Kate W.",
   "Name_url": "https://www.yelp.com/user_details?userid=EYPCjQIkIwX6KgQHTy0iDQ"
  },
  {
   "Date_Posted": "5/27/2014",
   "Review_Comment": "The horchata is HUGE, so it might be nice to share one. Get the traditional tacos and you won't go wrong. Al pastor were my favorite. (Remember to visit the salsa bar!)",
   "Name": "Amanda R.",
   "Name_url": "https://www.yelp.com/user_details?userid=wVxCous7f3glCSyBqNJ9uA"
  },
  {
   "Date_Posted": "6/14/2015",
   "Review_Comment": "Decent Mexican food but nothing that I'd write home about! Sopas ware good, but the Tostadas are rather pricy for what you get. Lots reviews seem to rave about this place, I just don't see why. There are plenty of other taquerias in the Atlanta area that are just as good.",
   "Name": "Richard K.",
   "Name_url": "https://www.yelp.com/user_details?userid=p6dNRqVCsA-EH8Y-At9fzA"
  },
  {
   "Date_Posted": "12/7/2013",
   "Review_Comment": "I've been eating here for a decade now, and I still haven't come across a better taqueria in town. That said, it's a little more \"formal\" than the average taqueria, meaning it's a sit-down place with a larger menu. But prices are comparable, the salsa bar is fantastic and offers some non conventional selections, and the food is beyond compare.\nThe thing you have to have at least once is the tlayuda, the gigantic Oaxacan pizza-ish disc that is still hard to find even after all these years. In my more bulletproof youth that was my only menu order - I'd have to call them ahead of time and ask \"tiene tlayudas para hoy?\" (though they became much more bilingual once they moved into a former Captain D's). But nowadays I only get one if I've been fasting for the previous 2 weeks or so. I've learned that the huarache quesillo oaxaca is an acceptable lower-volume substitute, and that the sope is an acceptable lower-volume substitute of the huarache. My routine as of late has been to get the latter with a tamale that has strips of peppers in it - yes, a taqueria with vegetarian options, believe it.\nThe only downside I can say about the food is that I walk out feeling like I have to avoid children, lest they be tempted to ram a stick through me and gather the candy that would spill out. Not South Beach Diet-compatible, in other words.\nStill, you haven't had the best Atlanta offers unless you've been here. Comprende?",
   "Name": "Scott W.",
   "Name_url": "https://www.yelp.com/user_details?userid=9CJjesmjHHxL8a04Vr9MGA"
  },
  {
   "Date_Posted": "8/30/2015",
   "Review_Comment": "I've ordered the veggie quesadilla on multiple occasions and it is just fantastic. The salsa bar is incredible. At times the service can be a bit slow, and depending on who's there it's worth brushing up on your spanish, but the quality and authenticity of the food is just wonderful. This is a favorite of mine.",
   "Name": "Derrick V.",
   "Name_url": "https://www.yelp.com/user_details?userid=0MH8Wu3PxC4Dv8by7hKn-Q"
  },
  {
   "Date_Posted": "3/24/2012",
   "Review_Comment": "Well I guess i'll have to be the bad guy here. After all of the glowing reviews I had to give this place a try since I was on the south-side. The place isn't hard to find & once you get there you will find nothing but the locals eating here. So needless to say I stuck out like a sore thumb. Well there was a table of Asian-Americans across from us so they might have stuck out a bit more. Got the street taco's because i've always wanted to try them and the Oaxaquena one's are as close as i've gotten to street tacos. Had the Steak and Pastor Pork ones. The steak was OK, but the Pork was really good & i was sorry I didn't get two of them. Had the beans and rice with this and my sides were OK. It wasn't this life altering experience that others have had here or maybe I built this up to be more than it really is. I may try this place again but I won't burn the gas to go out of my way.",
   "Name": "Darren H.",
   "Name_url": "https://www.yelp.com/user_details?userid=O1Q3E7A4CshJ0QIlPNpRTg"
  },
  {
   "Date_Posted": "10/23/2015",
   "Review_Comment": "Fabulous service, great décor, best of all its food. I ordered a huge tlayuda, and I enjoyed it tremendously. It is like a humongous tostada. Love the place and waitresses are very friendly and courteous. A+",
   "Name": "Max M.",
   "Name_url": "https://www.yelp.com/user_details?userid=cUolzeKHnNIbj_0zUGEVQg"
  },
  {
   "Date_Posted": "10/11/2015",
   "Review_Comment": "Amazing and authentic! Best Mexican food around town. Salsa bar is fantastic and so was the service.",
   "Name": "Christie J.",
   "Name_url": "https://www.yelp.com/user_details?userid=iebpWj_ofOhnOYZrjgkUeQ"
  },
  {
   "Date_Posted": "4/14/2014",
   "Review_Comment": "Some people will tell you Taqueria del Sol is the best place to get a taco in Atlanta. These are probably the same people that don't leave Decatur, let alone travel outside the perimeter to the South Side. Those people are wrong.\nTaqueria La Oaxaquena is not in the business of serving you tacos with coleslaw, or cheesy stuffed nonsense. This is legit Mexican food. Its cheap, delicious and most importantly, authentic. If you're really adventurous, try the Tacos Estilo. You can get tripe, beef tongue, or BBQ goat just to name a few. The regular tacos are $1.99, and are served with fresh cilantro and onions. The Tacos Americanos are their regular tacos served with sour cream, lettuce, and tomato. The chips are free and endless if you're dining in, and they have a salsa bar that really puts the one at Moe's to shame.\nThis place is more than just tacos and chips though. The tamales are huge, although I wish they had a little more meat in them. They have special platters and soups, and even flan and smoothies for dessert.\nIf our service was better, I'd give this place 5 stars, but as sweet as our waitress was, she was really bad at her job. She wasn't attentive, and seemed a little scatter brained. We'll definitely be back though, because the food is just outstanding.",
   "Name": "Brea D.",
   "Name_url": "https://www.yelp.com/user_details?userid=u6y3nsYHrlk3Hpw07d0wwQ"
  },
  {
   "Date_Posted": "8/28/2015",
   "Review_Comment": "Hubby and I have patronized this local spot for more than a decade - since they were in a little strip mall on Tara. Back then everyone spoke only Spanish and it was a cash only operation. They now have bilingual staff, accept credit cards and grew to earn a stand alone structure around the corner from where they originally began. Food is delicious Mexican not a Tex-Mex joint. Service is pleasant and fast. Me encanta La Oaxaqueña!",
   "Name": "Lucas G.",
   "Name_url": "https://www.yelp.com/user_details?userid=joeo_-Df5iahI852E5UWjQ"
  },
  {
   "Date_Posted": "10/30/2013",
   "Review_Comment": "This is clearly one of the best Mexican restaurants in the greater Atlanta area. The portions are monstrous, the prices are low, and (most importantly) the food is delicious. Their cheese is especially delicious. Most recently, I had a burrito and a huarache. I recommend them both, but if I had to chose, I'd vote for the huarache--the bread is amazing.\nOn top of great food, they have a salsa bar where you can fill up on as much salsa as you see fit. It seems a little less than sanitary, but just don't think about it.\nTip: Don't eat one of their jalapenos when you're driving. I love spicy food and the first one I ate was fine. But the second one had been genetically modified (or something like that). I've never had a jalapeno so hot; I had to make an emergency road-side stop because my whole face was on fire.",
   "Name": "Cameron G.",
   "Name_url": "https://www.yelp.com/user_details?userid=btSaJqMiUwMemMZ1AhCe3Q"
  },
  {
   "Date_Posted": "4/17/2015",
   "Review_Comment": "Now that I have been spoiled with authentic Mexican food in Los Angeles. I was skeptical about this place, to my pleasant surprise it didn't disappoint. I had a sample of 4 different items. I love a good al pastor burrito and this one was huge! Beans and rice were exceptional. This place is the real deal! I also like the Buche taco too (pork stomach also called hog maws). It's more adventurous fare but I enjoyed it grilled in a little taco. You have to take advantage of the salsa bar. Salsa heaven! If you are craving Mexican and on the Southside there really is no other option.",
   "Name": "Antiwan T.",
   "Name_url": "https://www.yelp.com/user_details?userid=6L9be4og1gkDah69l9csOA"
  },
  {
   "Date_Posted": "4/24/2015",
   "Review_Comment": "First time, was just ordering food to take home. Great experience, everyone was super friendly. Ordered the torta de carne asada....que rico...it was delicious and came with some really tasty fries....will be coming back for sure. Maybe next time we'll sit down and it there.",
   "Name": "Cynthia R.",
   "Name_url": "https://www.yelp.com/user_details?userid=bva5w58HJNfVd5ZtGQ144w"
  },
  {
   "Date_Posted": "3/4/2015",
   "Review_Comment": "Cute little Mexican restaurant....Ordered the quesadilla lunch special for only 6.99 which is a great price for what you get....chicken was seasoned and the onions all tasted great! Service was lacking a bit but other than that I enjoyed the food and will probably return.",
   "Name": "Brianna J.",
   "Name_url": "https://www.yelp.com/user_details?userid=OZ8c81Y5cjSQVMwU7S7g1A"
  },
  {
   "Date_Posted": "8/24/2016",
   "Review_Comment": "So this place is a hit or miss for me some days it's good and some days it isn't but I do have to say that they have a short male Hispanic waiter or cashier that is just the rudest. He's been my server a few times and he will not be my server if I go and eat there again. In one occasion he followed us to the table did not introduce or welcome us and asked what did we want to drink, got our drink order did not ask if we want the small or the large size and just bought the big size to us. All the tables around were bought chips and salsa by their servers and he didn't even bother. Checked on us once and then when we were paying that's when he tried it. It was 3 of us and we all had our own ticket. I handed him my ticket and he charged me for the other persons ticket so he's like well ask him to give you his change and had an attitude. Like no YOU can refund me the money and YOU give me the right change. Had an attitude about the whole situation. And yes one bad incident can do it for me. They need better customer service and make sure they're food is good all the time not just sometimes. Other occasions it has been whatever since I place to go order on a blue moon.",
   "Name": "Sandy M.",
   "Name_url": "https://www.yelp.com/user_details?userid=IZCEbCedBh1QBVQQiVjfDA"
  },
  {
   "Date_Posted": "12/29/2014",
   "Review_Comment": "It seemed hit or miss, possibly due to my American palate. We did not like the mole, the tacos were great, the torta was flavorful but very spicy. The portions were great for the price, and all the ingredients were fresh. The horchata is made in house, a bit grainy and thick but fresh and sweet. The flan was also fresh made and a nice sweet finish.",
   "Name": "Candace M.",
   "Name_url": "https://www.yelp.com/user_details?userid=VdALVh7oQL_uqkW9AlILNg"
  },
  {
   "Date_Posted": "9/23/2013",
   "Review_Comment": "This ain't your local Tacobell or texmex place, don't even dare come here if you want that kinda 'mexican' food. This place is legit and authentic!\nI went here for one thing...Menudo. No, not that stupid boy band crap from the 80's but Mexican soup served with tripe. Yes, that is beef stomach, and it's awesome by the way. Don't judge until you've had it, it's delicious and a supposed hangover cure. And, it's only served on Saturday and Sunday, by tradition.\nThe menu is very eclectic and first timers will have a hard time deciding on what they want because the item selection is vast...my wife had the torta which was spicy as hell but damn tasty. Another person had a variety of tacos including the ox and beef tongue and a few others I don't recall at the moment...everyone left with a full belly and big smiles!\nTo go with the excellent food, service was very fast and friendly and the price was just right. So, step out of your comfort zone and get something different, you may just like it.",
   "Name": "Steven G.",
   "Name_url": "https://www.yelp.com/user_details?userid=4zROzon9LmsSFgb2QulXMA"
  },
  {
   "Date_Posted": "7/6/2013",
   "Review_Comment": "First timer and it was great! Had some special steak torta \"bomb af\". Friends had some other stuff but overall this place is great.",
   "Name": "Brandon E.",
   "Name_url": "https://www.yelp.com/user_details?userid=kT-ZV_q0Sa3X_6x3UouahA"
  },
  {
   "Date_Posted": "9/13/2015",
   "Review_Comment": "Growing up in Arizona and Southern Cali I am pretty familiar with authentic Mexican food and this place is as close as it gets in Georgia! I am salivating right now just thinking about their barbacoa huaraches. From the wait staff to the salsa bar this place screams flavor! I would go every week but my wife is not a fan and it is a long commute for us but definitely worth a pilgrimage to food Meca. I learned a long time ago when looking for a good authentic Mexican restaurant you need to look at who is eating there. The last time we went we were the only gringos in the place which to me is a good sign. Prices are more than reasonable and well worth it. The atmosphere is dated and expect to listen to Telemundo or a football (soccer) in Spanish so bring good company if you only speak English. The waitstaff is gracious and they all speak English in case you have any questions. Definitely try their guac sauce and go out on a limb and try the lingua tacos or menudo!!!!!",
   "Name": "Wesley H.",
   "Name_url": "https://www.yelp.com/user_details?userid=74977wrVYyDOFrq3GIlq-w"
  },
  {
   "Date_Posted": "1/19/2013",
   "Review_Comment": "I hardly need to add my tiny non-Elite voice to the chorus of praise, but since I'm one of the few southside Yelpers, I'm going to plug a fine southside restaurant - Taquería La Oaxaqueña.\nIt looks like nothing - like a remodeled McDonalds. But the food - omg, the food! If you want hearty, filling, delicious authentic Mexican, this is the place to come, period. I'd recommend something specific, but honestly, just get what looks good - because it will be.\nLosing one star simply because it's not a place to hang out and eat in a leisurely fashion - it's a bit loud, and the plastic benches aren't comfortable. Just enjoy the food, and move on.",
   "Name": "Elizabeth M.",
   "Name_url": "https://www.yelp.com/user_details?userid=2Vx7sIgjj_DymG-NNpjDdg"
  },
  {
   "Date_Posted": "9/8/2013",
   "Review_Comment": "Made me feel like I was on vacation. Food was different and a great change of pace. We had the Mexican pizza served on a plastic serving tray. Enough to feed three easily. Also had the tacos and all were tasty. Salsa bar was a great bonus as we mixed a few to get the flavor and heat level that we enjoy. Look forward to our return.",
   "Name": "Jay T.",
   "Name_url": "https://www.yelp.com/user_details?userid=5ZFGnaIS4wq-j08pu5khEA"
  },
  {
   "Date_Posted": "3/16/2015",
   "Review_Comment": "The good is excellent! Very authentic and flavorful. The salsa bar is great.... with awesome guacamole on it. The service can be very iffy. I've had good service and bad service. Never great service. The food is awesome enough that i will continue to go.",
   "Name": "Kimberly B.",
   "Name_url": "https://www.yelp.com/user_details?userid=uTakpHdkpS3s-y-qh9mg7g"
  },
  {
   "Date_Posted": "7/29/2014",
   "Review_Comment": "Don't live in Atlanta, believed in the yelp community, found this little gem. You know it's good Mexican food when you are the only one who speaks English! And it was cheap!!! All the guacamole I ever wanted!",
   "Name": "Jeremiah F.",
   "Name_url": "https://www.yelp.com/user_details?userid=9W62uPyjpsDSKTvjai8tgQ"
  },
  {
   "Date_Posted": "6/23/2014",
   "Review_Comment": "Nice authentic, but still a lot of the normal american tex mex stuff too. Everything is great though! Even the rice and beans are amazing! Last time I went there, service was a little slow, I think because of someone new there, but I won't count that against my star rating which is mostly for the food!",
   "Name": "Jason C.",
   "Name_url": "https://www.yelp.com/user_details?userid=vr8s8V-PZZllfdH43Xd6jg"
  },
  {
   "Date_Posted": "5/9/2014",
   "Review_Comment": "Why this place doesn't have 5 stars is a freaking tragedy. This may be the best taqueria mexican restaurant I have ever been too. Name it they got it and it is great cabeza, barbacoa, pastor, on the most awesome corn tortillas. Soups menudo, soup not band, and 7 fishes are just perfect. Have a Mexican coke and finish with a piece of chocolate flan. It is so large it must have 10 eggs in it. Seriously good mexican.",
   "Name": "Erik L.",
   "Name_url": "https://www.yelp.com/user_details?userid=eGP-Zrj3Nz1jdMm7XwRNvQ"
  },
  {
   "Date_Posted": "12/12/2015",
   "Review_Comment": "I thought that I had found a gem... I have eaten here several times and really enjoyed the food. However you can only imagine how disgusted I was when I ordered takeout early one morning and saw several roaches. The young lady who was restocking desserts was killing roaches that had gotten in the dessert cooler. The bin with the to-go cutlery had roaches in it. Not sure if the staff was trying to remain cool or if they were just used to them. I really wish they would exterminate because the food WAS phenomenal.",
   "Name": "Urban F.",
   "Name_url": "https://www.yelp.com/user_details?userid=n_61DLxuJEXsQE6CutpfRg"
  },
  {
   "Date_Posted": "2/3/2015",
   "Review_Comment": "Like several other reviewers, my main reason for eating here today was to see if this place lived up to the incredible hype. I was fairly confident that I'd be enjoying a delicious meal upon entering, and...boy...it was nice. I ordered 3 carne asada tacos at $2 a piece, while my girlfriend ordered a downright gargantuan carne asada burrito for $6. The seasoning on the steak, combined with the free salsa bar made these tacos close to flawless. Could not ask for much more out of a $12 meal for 2 people. Next time I will surely be more adventurous, everything on the menu looks great. 6 out of 5 stars",
   "Name": "Drew B.",
   "Name_url": "https://www.yelp.com/user_details?userid=w_sbqncDs1Td7cuB-CPSLQ"
  },
  {
   "Date_Posted": "10/10/2013",
   "Review_Comment": "Place was great!! The chips were fresh bad crispy n salted just enough. The place was clean. The salsa bar was clean and had a lot of choices. The portions were huge. And I can eat a lot.\nIt's basic and no frills But dang the food was great. N incredibly fresh",
   "Name": "David B.",
   "Name_url": "https://www.yelp.com/user_details?userid=PY8vQ20VaoelyaMqlsCPBw"
  },
  {
   "Date_Posted": "1/27/2015",
   "Review_Comment": "Some of the best tacos in town! I am a big fan of their pork stomach tacos. However, their menu does offer a lot of choices in which I still have to try. One good reason I love their tacos is because of their handmade tortilla! Very authentic!",
   "Name": "Daniel C.",
   "Name_url": "https://www.yelp.com/user_details?userid=79zgNhxWLH83CUfM4W4KOg"
  },
  {
   "Date_Posted": "9/10/2010",
   "Review_Comment": "When you order chicken soup to go you get a huge styrofoam container of chicken broth with an intact chicken thigh and leg, whole carrot, whole tomatillo, ear of corn, whole potato, and a side container with chopped up fresh onions, cilantro, and jalapenos, \"mexi\" rice, and tortillas. Once you get home you will need to cut the chicken off the bone, remove the fat, and cut up the vegetables, then throw them back in the broth along with the side container filled with goodies. Once your prep work is done you can then slurp on some damn good spicy chicken soup. If you don't like to put work into a prepared restaurant dish you might want to skip La Oax's sopa de pollo.\nI know you people think their Tlayuda is the best in the west..errr south west... of Atlanta (barely), I beg to differ. Not sure if I caught the pollo tlayuda on an off day, but the tortilla it came on was chewy and stale as hell. Maybe it is supposed to be like this. If so - I apologize tlayuda. Otherwise, I was hoping for a nice crispy bottom on which I could carry all other excellent ingredients right into my mouth with a satisfying crunch. I didn't get the crunch I was looking for which left Stephie a sad, sad girl. The ingredients that topped the stale tortilla were delicious though, which mostly made up for lack of bite. I would probably stick with the vegetarian tlayuda next time since I felt like the chicken didn't really add much.\nThough I can't actually pronounce the name La Oaxaqueña, I will check their tlayuda out again just to see if the snap, crackle, crunch is back.",
   "Name": "Stephie Z.",
   "Name_url": "https://www.yelp.com/user_details?userid=tvFpp0WS0PGf-wjFn6shMg"
  },
  {
   "Date_Posted": "10/26/2014",
   "Review_Comment": "I'm from San Antonio, TX and as we all know, finding good Mexican food in the deep south is like a diamond in a rough. Thanks to Yelp, i came across this place and it's actually pretty good. It reminds me of home. Their prices are reasonable and the portions are plentiful. If you do not live in Jonesboro, then you're out of luck unless you are willing to drive here. It's a busy place, so you will have to wait, but it's worth it. :)",
   "Name": "Kwayne B.",
   "Name_url": "https://www.yelp.com/user_details?userid=jwvZYEyF012esWkdosUm8g"
  },
  {
   "Date_Posted": "9/30/2012",
   "Review_Comment": "Ok.. Um, no alcohol, where they do that at? This is the first mexican spot that I have been to that was a dry house... Not even a corona. Im not a drinker but I like to try margaritas... The kicker, my bf was excited because he saw a huge margarita glass, his bubble burst when he was told it was a mango milkshake. LOL Oh, food was decent, I was sooo excited after reading reviews from yelp. I walked in with high expectations. My favorite thing was the guac. I wanted to take it all home!",
   "Name": "Yolanda M.",
   "Name_url": "https://www.yelp.com/user_details?userid=h1D0X2Yu34zPozAHkVO73w"
  },
  {
   "Date_Posted": "3/27/2013",
   "Review_Comment": "Really love this place. My girls and I went on a night out and had a great time. I got the half chicken plate and needless to say it was a take home...lol. Their 1/2 chicken is soooo good. Its was very spicy but I like my food that one. One of my daughters had the torte (chicken). I didn't know what it was until they brought it to our table. I never seen a sandwich so thick...\nI love their fresh salsa bar. This is a great place to go.",
   "Name": "Conchata W.",
   "Name_url": "https://www.yelp.com/user_details?userid=s9wO3hV1Px1tULIq7y5KIg"
  },
  {
   "Date_Posted": "1/4/2014",
   "Review_Comment": "I have been frequenting this place since its' opening.\nThis is the best place I know for authentic Mexican tacos.\nI love the salsa bar. I think it is a great touch that there are nopalitos (cactus) salad on it as well.\nI cannot recommend it enough.\nThe staff is very efficient as well.",
   "Name": "Alane H.",
   "Name_url": "https://www.yelp.com/user_details?userid=JAITcbSf6p6AyTz3UxUuxw"
  },
  {
   "Date_Posted": "10/29/2013",
   "Review_Comment": "I have been here countless times. I absolutely love this place! I call ahead and order for take out(atleast 4 times a month) and we go in and sit down(around 3 times a month). I also love to take my out of town guests here.\nMy favorite is the steak quesadilla. My fiance loooves the pastor burritos.\nWe will be back!!!",
   "Name": "Janet W.",
   "Name_url": "https://www.yelp.com/user_details?userid=31N7pE-ZanRec9PgooVQIA"
  },
  {
   "Date_Posted": "12/30/2013",
   "Review_Comment": "After the fantastic taquería in Rome, GA, and after all the rave reviews of this place, I was expecting better. Had barbacoa (goat) gordita, flat meat taco, rice, and an empanada with green sauce and another with red sauce. Also had some flautas sprinkled with crumble cheese.\nBetter than American-Mexican. But the ingredients could be fresher/better. It just seemed too mass-made.",
   "Name": "Zachary S.",
   "Name_url": "https://www.yelp.com/user_details?userid=iMd0ndzCj2uAhz71_gULnw"
  },
  {
   "Date_Posted": "4/30/2014",
   "Review_Comment": "Hands down, the best Mexican food on the southside. The fresh salsas and salads that are complimentary with the meals are a culinary force that rivals other taqueriasin the area. The entrees are delicious and expertly prepared. The staff are friendly and very helpful and knowledgeable. I visit this place often and have never had a bad experience. Viva la Oaxaquena!!!",
   "Name": "Chef William S.",
   "Name_url": "https://www.yelp.com/user_details?userid=ExCaXlTABxpqSRlMzqEk6Q"
  },
  {
   "Date_Posted": "3/20/2010",
   "Review_Comment": "Wow. I mean, WOW.\nI don't normally get enamored by Mexican food - it's heavy, cheesy, and greasy. As I get older, I tend to prefer food that won't have me feeling like I drank a barrel of Saudi oil or as gassy as drinking a gallon of milk. However, Taquería La Oaxaqueña is a rare exception.\nFirst, they have a salsa bar. A rather impressive salsa bar. Pickled veggies, pickled chipotles, and about 6 different salsa and guacamole dip. I ordered a basket of chips, carne asada, and just for giggles (thinking it would be about as small as Taco Bell), a gordita. When I was mulling more (the cheese corn always gets me) - the waitress told me, \"señor, you don't need anymore - that's enough food.\" I am always appreciative of a server who is stopping me from stuffing myself like it's Thanksgiving in Spring and saving me a few bucks.\nOnce done, I got up to get some salsa. I picked about four salsas and some of the guacamole dip. But here's a quick recap:\nSalsa roja - run of the mill tomatillo and chiles\nSalsa verde - same\nGuacamole dip - smooth, creamy, not straight guac, but it's still tasty\nSalsa de gujillo - this red, creamy concotion was quite flavorful and not too spicy\nSalsa de cachuate - WOW - smooth, creamy, tomatoey with a hint of peanut. I had to ask to confirm my suspicions - but once I found out, it went on almost everything.\nWhen the food came, I quickly saw why she told me to quit. The whole table was covered in plates. Between my basket of chips, my plethora of salsas, tortillas, amy gordita, and my carne asada, I barely had room for my flatware. But, as my old jumpmaster instructor used to say, \"make it happen, airborne.\"\nI somehow managed to finish nearly all of it - I hadn't stretched my stomach like that in a while. The carne asada was two rather large flat briskets of flank steak and the gordita was completely stuffed with chorizo. Eating here was like having a siesta in my mouth where only I was in invited.\nNow, a note for those who would like to suddenly flood the place - if you are in the southside area, you'll know that this isn't one of the best neighborhoods around. As a matter of fact, if you don't use a GPS, it's easy to lose this place since it's tucked off behind a store to the left as you travel down the main road. The inside is also a bit divey - for some reason I'm surprised this hasn't hit Guy Fieri's DDD show yet. Show up in anything fancier than a polo and jeans and you'll definitely stick out.",
   "Name": "Jake K.",
   "Name_url": "https://www.yelp.com/user_details?userid=7bwDw99gKkuxr-zBtzqvCg"
  },
  {
   "Date_Posted": "4/16/2012",
   "Review_Comment": "I've said this before, and it bears repeating. I've had a longstanding desire to be, even slightly, offended at a Mexican restaurant so that I can throw THE BIGGEST B-TCH FIT EVER and vituperatively yell, \"HEY!! F-CK YOU, GRINGO!!\" To me, \"gringo\" is one of the funniest insults out there, and I'd love to take it for a test drive.\nAs a general rule, when choosing a Mexican restaurant, eat at one that Mexicans prefer. When choosing an Italian restaurant, eat at one that Italians prefer. When choosing a Chinese restaurant, eat at one that Chinese prefer. When choosing a seafood restaurant, eat at one that fishermen prefer. You get the idea. So when I walked into Taquería La Oaxaqueña and saw Latino patrons, servers, kitchen personnel, and Mun2 on the televisions, I knew that this place is home to authentic Mexican cuisine. In fact, some of the staff exclusively speak Spanish, which led to some confusion and a free cow cheek huarache. :) Incidentally, I'm somewhat proud of myself for correctly pronouncing the menu items that I ordered (i.e., not being a major gringo) and for finishing all of my food, which is a remarkable feat considering the generous portion sizes.\nI ordered a goat taco, cow cheek taco, and steak huarache. This was a great deal of food, especially for these prices. The tacos were quite good, as was the pork burrito that a friend allowed me to sample. This was my first taste of cow cheek, and I was impressed; the cow cheek is tender, with a gelatinous edge, and tastes familiar enough that even an unadventurous gringo would devour it without hesitation. That said, what I was most pleased with was the huarache. Do yourself a favor and order it. The crunch of the fried cornmeal topped with beans, lettuce, sour cream, cheese, and meat will turn you into a salivating customer for life.\nAnd so, BELIEVE THE HYPE! Other yelpers are sooooo right to recommend this one. The food here is beyond extraordinary, and yelp proves its usefulness once again!",
   "Name": "Sidney E.",
   "Name_url": "https://www.yelp.com/user_details?userid=7nZRgboPUhjotyGdv3FGEA"
  },
  {
   "Date_Posted": "2/2/2013",
   "Review_Comment": "Cheap and delicious tacos! The Goat and Lengua tacos are absolutely delicious! The ingredients are fresh and flavorful and the salsa is spicy!",
   "Name": "Sarah F.",
   "Name_url": "https://www.yelp.com/user_details?userid=Y8wK-S-Er2vzNmnU6XAy-g"
  },
  {
   "Date_Posted": "8/21/2014",
   "Review_Comment": "Yep. Do beleive the hype. This is as good as it gets. The salsa is a must try. All the salsa are fresh and very tasty. The guacamole is really really good. Really as close to perfection in a taco as I've had.",
   "Name": "Emory B.",
   "Name_url": "https://www.yelp.com/user_details?userid=L2lSnnyht3fB-ONcU2NaFw"
  },
  {
   "Date_Posted": "7/16/2014",
   "Review_Comment": "How is it that I have not reviewed this place before. We go all the time and love it every time. We feel guilty driving all the way to Jonesboro for Mexican but once we are there and had eaten we know exactly why. It is terrific and totally worth the drive! They have the best Al Pastor in the city no matter what form you get it in. Very authentic food.",
   "Name": "P K.",
   "Name_url": "https://www.yelp.com/user_details?userid=KohIXBxYx-FdOQVG_Djuvw"
  },
  {
   "Date_Posted": "10/5/2012",
   "Review_Comment": "Good authentic food and very good prices. Huge portions. Definitely a must go to establishment!",
   "Name": "Ashley W.",
   "Name_url": "https://www.yelp.com/user_details?userid=CRsEg698EdY2FrPJq9o28g"
  },
  {
   "Date_Posted": "9/20/2014",
   "Review_Comment": "Poor service I feel the group I was with was singled out for race reason. We are a group of professionals and couldn't get adequate service I will never eat here again",
   "Name": "Kane S.",
   "Name_url": "https://www.yelp.com/user_details?userid=CPvm34Fv2x42dQkXc6SzHQ"
  },
  {
   "Date_Posted": "1/23/2012",
   "Review_Comment": "This is the first time in my life that I have been to a Mexican restaurant and there were actual Mexican people eating there, roughly 80% to be exact. To say it was an authentic establishment would be an understatement. I had flautas which are chicken taquitos to us americans.They were not like any taquito I have had. The chicken was uber flavorful and the rice and toppings that came with it was really good. I also had Horchata, which is a rice water. I have never had anything like it and It was good stuff. It was an enlightening experience. After eating here I realized that in my life I have never really had Mexican food because the places I have tried pale in comparison to this place and seem completely different. If you ever run into someone who loves AUTHENTIC Mexican promptly send them here. If they want American Mexican you can send them to Agave.",
   "Name": "Tramaine W.",
   "Name_url": "https://www.yelp.com/user_details?userid=pTUlF0nvcUOEbg8E_8QWxg"
  },
  {
   "Date_Posted": "9/11/2013",
   "Review_Comment": "Best authentic Mexican in Georgia! Mole is amazing. Great tamales! Awesome salsa bar with a variety of salsas including guacamole.\nIts important to note that fancy mexican restaurants don't have good mexican food. So since this place has great food, be sure you aren't going for the decor.",
   "Name": "John P.",
   "Name_url": "https://www.yelp.com/user_details?userid=QiSkXabYB-kOzS1-lcgRtQ"
  },
  {
   "Date_Posted": "1/29/2012",
   "Review_Comment": "Had a large party at work and came here to get a massive amount of chicken. They were on time with my large order and even helped me bring it to the car. The salsa bar was pretty intense, and all quite delicious.\nI'd come back for a large catered event. I'll have to swing by soon just to grab lunch to check a normal portioned meal. Everyone working seemed very friendly and on their game. All the food was great, and my staff was employees were very happy.",
   "Name": "Paul S.",
   "Name_url": "https://www.yelp.com/user_details?userid=IordAFVDQsYRYw8Ec87f9w"
  },
  {
   "Date_Posted": "7/2/2015",
   "Review_Comment": "Went here had the traditional Mexican tacos, the prices are great and the food is ok as well. The service however is not the best the waitresses are nice but don't expect for them to come to your table and check on you or ask if you need anything you'll have to track them down for that but overall it's ok",
   "Name": "Che J.",
   "Name_url": "https://www.yelp.com/user_details?userid=ng2y98TlUuhpeZFPdx_yDA"
  },
  {
   "Date_Posted": "1/24/2013",
   "Review_Comment": "We were pleasantly surprised with Tanqueria La Oaxaquena. Great, inexpensive, food! Many of the other Yelpers hit the mark with their reviews. Not the fanciest establishment, but great friendly staff and food made up for it. We spent about $20-$25 and had enough for two people for two meals. Really beat any other place we could have stopped and was just outside of the craziness of Atlanta.\nI LOVED their salsa bar. Homemade, deliciousness full of cilantro and spicy goodness.",
   "Name": "Liz M.",
   "Name_url": "https://www.yelp.com/user_details?userid=61ZZd0eLPkPA6CI8j2ia1w"
  },
  {
   "Date_Posted": "5/9/2014",
   "Review_Comment": "Easily the best Mexican restaurant around. Had the pork burrito. Flavor was amazing. The amount was filling. The salsa is incredible. Price is perfect. Don't waste time. Do yourself and your palette a favor and try this place out.",
   "Name": "Andy S.",
   "Name_url": "https://www.yelp.com/user_details?userid=Z44nBtQ5E5WqeNkFANPr-w"
  },
  {
   "Date_Posted": "9/27/2011",
   "Review_Comment": "A find in a dining wasteland south of the city. Excellent value for the money, and that salsa bar just puts the crown on a great dining experience. Probably not for those who prefer their Mexican on the TB flavor profile; anyone adventurous should absolutely try it. We usually get the tlayuda with chorizo and have enough left for two meals the next day....\nOn occasion, it can be a while to get your food, especially prime dining hours. Do what one family did: Order dessert first and enjoy the flan (a huge portion that served the whole table)\nHighly recommended -- new location is a big improvement over the cramped old one. One of these days we will explore the goat barbacoa platter.",
   "Name": "Birgitta W.",
   "Name_url": "https://www.yelp.com/user_details?userid=seTHqCRfkIvm7s84cU9F2g"
  },
  {
   "Date_Posted": "7/16/2011",
   "Review_Comment": "BEST. Salsa. Bar. Free guacamole? Yes!\nBest Mexican meal I've had in years, really. Very sweet and attentive service-feels like family, like they really care whether you love it. I told our lady how amazing the mole sauce was and she brought over a nice side dish of it. Everyone reached over me to get some after tasting my\nChicken Mole Tamale: Massive masa bomb stuffed with tender chicken and perfect mole wrapped in banana leaf. One of the best I've had..UPDATE: had one 3/12 and it was dried out. They were super busy, and the food quality seemed to suffer.\nCarnitas: Nice and crispy without being greasy.\nFlautas: Dad got them, he didn't share, even though there were four.\nGorditas: They don't call them \"little fat ones\" for nothing. They are big, and so was my belly after eating it. I got beans and cheese, very nice.\nWe brought a flan to go. Noticed it was $5, but it felt like it weighed a pound. Will eat for breakfast. (Update: not good, tasted like it was made from a mix).\nGreat meal+Amazing deal=joyous me. Dinner and leftovers for four, $33.\nFood coma alert! Portions are major.\nCheers~",
   "Name": "Heather N.",
   "Name_url": "https://www.yelp.com/user_details?userid=lExyz31t8t6DBRxmu858eg"
  },
  {
   "Date_Posted": "5/10/2015",
   "Review_Comment": "I never knew Mexican food can taste so fresh and delicious. Wow just wow. The tacos taste like the tortillas were ground and made as I ordered them. Best Mexican place I been to, hands down.",
   "Name": "4cardAhmed A.",
   "Name_url": "https://www.yelp.com/user_details?userid=wMpvMqDTtSX2M9StbkEhdg"
  },
  {
   "Date_Posted": "7/31/2015",
   "Review_Comment": "This place is just ok. Customer service was great but it took forever for the food to come out. I have had better, also they are a bit over priced for what you get.",
   "Name": "Tonya L.",
   "Name_url": "https://www.yelp.com/user_details?userid=SM6VZ_1Gcuxv_Pyhe75C9A"
  },
  {
   "Date_Posted": "5/13/2015",
   "Review_Comment": "We saw it on yelp and tried it today. It was not fancy but the service was good the restaurant was clean and the food was very fresh. Both meals tasted great and the price was very affordable",
   "Name": "Basil H.",
   "Name_url": "https://www.yelp.com/user_details?userid=Qm7UE9vdUPHvTAjSuYp72Q"
  },
  {
   "Date_Posted": "2/11/2012",
   "Review_Comment": "Who knew, you go south past the airport and you end up in Mexico. I'm guessing this is authentic because they had lots of dishes I had never heard of. The tlayuda was awesome, a giant mexican pizza. Looked like lots of other good options as well.\nThere weren't many gringos there, but they did speak English. The service was nice, but the food took a long time to get there. Overall, worth a diversion if you're near the airport.",
   "Name": "Rob P.",
   "Name_url": "https://www.yelp.com/user_details?userid=IVp9NrCRfYduQKXEBk5ZAg"
  },
  {
   "Date_Posted": "5/3/2014",
   "Review_Comment": "Delicious, authentic food from Oaxaca! Had a chicken mole tamale for lunch and it was amazing. Best Mexican food I've had in Atlanta.",
   "Name": "TJ T.",
   "Name_url": "https://www.yelp.com/user_details?userid=pxhusIbXeL09rv-hSRRfIA"
  },
  {
   "Date_Posted": "3/21/2014",
   "Review_Comment": "I love this place THE BEST !!!! Taco salad and tacos wish they had fried ice cream though :) would get it everyday",
   "Name": "Trini T.",
   "Name_url": "https://www.yelp.com/user_details?userid=taRlrGmJsJ7X4VlTQnj7qg"
  },
  {
   "Date_Posted": "10/28/2013",
   "Review_Comment": "After reading the reviews, what a disappointment. The guacamole was runny like a milk shake (clearly cut), runny beans, (should be pastry), the taco meat was burnt, and the service was bad.The only positive note was the corn chips were fresh, and the cheese dip had a great flavor.",
   "Name": "Holly B.",
   "Name_url": "https://www.yelp.com/user_details?userid=icRifKvFZfznc6T-0Gw0rA"
  },
  {
   "Date_Posted": "6/29/2011",
   "Review_Comment": "OMG... The burrito's here are the bomb!! I'm from California and I thought I had the best burrito there, but I am clearly wrong! I'm also Asian who can be quite picky with my food at times... so this review must mean a lot! I ordered the large lengua burrito and that was good for 2 meals, lunch & dinner. My burrito was loaded with meat, which is def. worth it! My dad ordered the pork tamale with green sauce and said it was a bit too spicy for him and liked the red sauce pork tamale better. For the most part he liked it though. I also ordered a side of rice and all I can say is... I can eat this rice all day, everyday.\nThe prices are well worth the food in my opinion. Large burrito for $5 something, tamales were $1.99 and the side of rice for $1.99!\nI am definitely coming back here again before I head back to mediocre burritos in California...",
   "Name": "Tiffany S.",
   "Name_url": "https://www.yelp.com/user_details?userid=cEg_I44ZSnxmIV0OxCoi8w"
  },
  {
   "Date_Posted": "9/11/2013",
   "Review_Comment": "The best Mexican food I have ever had. It may not look like much and the service is questionable, but the food you can't beat. The mole tamales are worth way more than $3.99!",
   "Name": "Jake K.",
   "Name_url": "https://www.yelp.com/user_details?userid=ZdXfVIXmBoWOnARUDPMxXw"
  },
  {
   "Date_Posted": "4/1/2014",
   "Review_Comment": "Visiting from Birmingham AL, I stopped by not expecting much since I am so use to walking into Tex mex style places. As soon as I received my order I was shocked at the authenticity of the food. This is as authentic as you get with real street style taste from Mexican streets. Don't let the bland feel of the decor fool you before ordering. The food here is exceeds expectations! Thanks for the great dinner :)",
   "Name": "Gustavo P.",
   "Name_url": "https://www.yelp.com/user_details?userid=DB_Lg7S70dZMvN6lqXhp0Q"
  },
  {
   "Date_Posted": "5/14/2014",
   "Review_Comment": "The food is superb!!! The taste is to die for!!! Very impressed. I work in the area, but will make the trip out there to bring my family. Good prices too!!",
   "Name": "Alicia J.",
   "Name_url": "https://www.yelp.com/user_details?userid=0BmdLDGBr6PQqLjMMLg-rw"
  },
  {
   "Date_Posted": "11/9/2013",
   "Review_Comment": "My co workers and I love the salsa bar it is the best. Everything tastes very fresh and authentic.",
   "Name": "Kim R.",
   "Name_url": "https://www.yelp.com/user_details?userid=9OX369LHioHf7YIqoLFEBA"
  },
  {
   "Date_Posted": "5/22/2011",
   "Review_Comment": "The well-travelled might thing of this as Mexico away from Mexico; I think of it as Buford Highway away from Buford Highway. Being intrigued by the Creative Loaving 100 Things to Eat Before You Die List, I planned a special lunch visit. The first thing to know: the tlayudas are huge. I am a big eater and eating one was a challenge that left me no room for dinner that night. Akin to pizzas in size, contents and density, these specialties are served on a giant crisp tortilla. Toppings include string cheese, avocados, tomato slices, meat of your choosing (pastor was a good choice), radishes (good addition to balance the proteins). It was a little tricky to eat, but it sure was good. Bring a friend or get a box, because it's really too much for even me to eat.\nThe restaurant appears to cater mostly to homesick immigrants, who packed the place when I was there. Communication with the servers was not a challenge. Service was friendly and attentive, but a little flaky, in that I respectfully declined chips and salsa (it does not appear to be free), declined them again, and then received a basket anyway. Food preparation was not fast, but it came out hot and delicious. Decor looks like a fresh renovation, with lots of big tiles and on the floor and half way up the walls. Seating was a bit more \"institutional\" and a little tight for my tastes, but reasonably comfortable nonetheless.\nThis place is a hidden treasure and Lord knows that Clayton County can use all the help it can get.",
   "Name": "Bill G.",
   "Name_url": "https://www.yelp.com/user_details?userid=NqhDxk1bh3pkpBDX-qa8oA"
  },
  {
   "Date_Posted": "1/27/2009",
   "Review_Comment": "First of all yelp has misspelled the restaurant's name is Taqueria La Oxaqueña not La Taqueria Oaxaquea or La Oaxaquena Taqueria.\nNow to the review. Taqueria la Oxaqueña has beeen named of of the top 50 restaurants by The Atlanta Journal Constitution (ajc.com). I have been a recurring customer at the taqueria. As an American who lived in Mexico for 4 years I can tell you that this is the real deal. I really love their cow's cheek taco (Tacos de Cabeza) they are extremely moist and the meat almost melts in your mouth.\nOther recommendations are tacos de chicharron (pork skin), al pastor, and carne asada (steak). However, if you are brave enough try their tripe tacos (tacos de tripa) really good too.\nAlso their tamales, sopes, and huaraches are to die for. Their ceviche is spectacular, and their shrimp tostada can be highly addictive. If you want a complete meal you can have their carne asada that comes packed with peppers, onion, nopalitos, avocados, white cheese, yellow rice, fried beans and a pile of tortilla all for less than $11.00.\nTheir service is very consistent. As soon as you step in everyone greets you. The place is usually pack with all types of Hispanic, hint hint..that means that the food they serve is truly authentic. Their prices are excellent too. Tacos are only 2.00 but they are HUGE. I can't eat more than 2 tacos without feeling full. The have certain dishes that they only make during the weekends, I believe \"menudo\" and pozole are two of them.\nAlso, I almost forgot have you ever tried a \"Cubana Sandwich\" (torta cubana) not to be confused with a \"Cuban Sandwich\". This is more like a kitchen sink sandwich but it is sooooo good. Try it someday, you won't regret it but please make sure if you are not into hot and spicy foods to tell them to HOLD the jalapeño.\nOne more thing, please remember that they moved recently. Their new place is near Sonny's BBQ and the gas station in Mt Zion.",
   "Name": "Liza C.",
   "Name_url": "https://www.yelp.com/user_details?userid=4kIlsZELPfcsJ24tWFkJsA"
  },
  {
   "Date_Posted": "1/23/2014",
   "Review_Comment": "Best Mexican food in South Atlanta, tried many in the area and this is the Best! and best value!",
   "Name": "AJ A.",
   "Name_url": "https://www.yelp.com/user_details?userid=mFK7vcxKbjG4pxSgVeuEog"
  },
  {
   "Date_Posted": "2/20/2013",
   "Review_Comment": "This place is AMAZING! I've had a lot of good Mexican food since I moved here, but this place is BY FAR, the best that I have had in the Atlanta area. Their sopes are so good and their prices are legit. West Coasters will be happy with this place.....",
   "Name": "Caitlin B.",
   "Name_url": "https://www.yelp.com/user_details?userid=WbYQ_-LfAZmZn30FrUb3zw"
  },
  {
   "Date_Posted": "1/11/2014",
   "Review_Comment": "I eat here like every other day. I live the steak tacos. Their beans and rice is so yummy. I always get the fresh fruit juice of the day.",
   "Name": "Monet T.",
   "Name_url": "https://www.yelp.com/user_details?userid=kO6oMrMRmhS1uA6klHL4Dw"
  },
  {
   "Date_Posted": "4/1/2014",
   "Review_Comment": "This place is fantastic. The food is beyond words. Nice price and the salsa bar is great.",
   "Name": "Mr. X.",
   "Name_url": "https://www.yelp.com/user_details?userid=Sa9ZeDfR-H-KaKxAalaqPQ"
  },
  {
   "Date_Posted": "4/27/2011",
   "Review_Comment": "It took me a long time to try this place. I had heard its good but I never went in. I'm not sure why but I regret not going in until today. To be honest, when I first walked in I thought it might be a bit of a mistake. The place feels a bit off. There are TVs speaking Spanish fairly loudly, the decor could probably use a bit of work but it all becomes worth it when you get the food.\nThe servers are extremely helpful almost to the point of annoyance. We were probably asked if we were ok at least a dozen times. It never got to the point of being really annoying but the potential is there. The servers were very helpful though and it is needed. The food here is what I imagine authentic Mexican to be, and to be honest, I had no clue what some of it was going in. The pictures were quite helpful and usually I'm against menu pictures but it helped me a lot here.\nThe initial food gotten at Mexican restaurants are always the tortilla chips, salsa and queso. It was no different here. The salsa was excellent. You could taste the tomato and it still had the chunks of vegetables in it. The salsa had a bit of kick which I love. Salsa is supposed to be a bit hot and this fits the bill of heat to perfection flavorable heat. The queso has a ton of cheese in it. It has enough to actually cling to the chip. There is nothing I hate more than dipping a chip in queso only to have it ALL fall off because it has no cheese to thicken it. That won't happen here.\nMy meal of choice was carne asada. It was divine. The steak was very flavorful and marinated to perfection. It was cooked with some tomatos, onions, and peppers. The peppers were jalapeno and actually had a bit of heat which was great. The refried beans still looked like beans not the mush you get at most places. The rice was good stuff as well and even had a few veggies in it.\nTo sum it all up, its authentic Mexican food it has some heat and it isn't the deadened flavors you get at chains across the suburbs of Atlanta. Give it a shot. You'll like it.",
   "Name": "Jason N.",
   "Name_url": "https://www.yelp.com/user_details?userid=nSa64v597A9a9AVYtOgB1g"
  },
  {
   "Date_Posted": "6/9/2014",
   "Review_Comment": "After reading all the reviews, my friends and I were excited to try it. We are only in town for a few days, and have some DELICIOUS FOOD, and fabulous service all over the city. welllllll, everything came to a screeching halt today. The salsa bar is good. They had several choices, but the guacamole was out. and it looked like for a while. the cilantro was fresh though.\nWe should have known when we sat down and were offered a table that was not clean. Really? you are going to seat me at a dirty table? I asked for a towel to clean the table, and the waitress cleaned it for me. A worker brought chips and salsa, which were good. That's where it all went bad. We were there at lunch, but it wasnt Slammed. It was busy, but don't restaurants like busy at lunch? I thought so. We ordered our food and drinks. A table sat down next to us and the waitress took their order at the same time. We sat for at least 15 minutes waiting for our drinks. The drinks came out, and my white queso, which is what started this entire quest in the first place. It was good, but bland. I spiced it up with some salsa and cilantro. We ran out of chips, and no more was brought out. The table that sat down after us got their food. A table down from us that sat down after us got their food. We finally had to request our food to go, since we didn't have time to eat it before we had to get back to work. We were there almost 40 minutes before we finally got our food to go. The waitress was rude, the food was marginal. In fast, i got their horchate and it was meh. My friend got enchiladas. They were like string cheese wrapped in a tortilla. I don't know if they did something to our food cause we needed to leave, or if the food was just not that good, but we all had bad tummies after we ate. and I only ate about 4 bites of my lunch. Kind of expensive for four bites. Yea, we won't go back, and would recommend people try a different place! Surly service, dirty, marginal food. Plenty of other restaurants in Atlanta!",
   "Name": "Lynn B.",
   "Name_url": "https://www.yelp.com/user_details?userid=kgZWLnutUOFYR4bdnoE3eg"
  },
  {
   "Date_Posted": "10/10/2013",
   "Review_Comment": "This place is terrifying and totally overwhelming. Do not eat here if you're a picky eater, there is nothing on the menu for you. Seriously. If you usually order chicken nachos or tacos at La Generic Suburban Mexican Restaurant, you're not gonna find that here.",
   "Name": "Mary K.",
   "Name_url": "https://www.yelp.com/user_details?userid=9Bc6L3HYlQpTktk9VkdFeg"
  },
  {
   "Date_Posted": "7/28/2013\nUpdated review",
   "Review_Comment": "They have really stepped up their game in the service department. The food is among the best Mexican you are going to find in this area of the country.",
   "Name": "Blaire B.",
   "Name_url": "https://www.yelp.com/user_details?userid=u9fOD3y2BxYifsyXQZMSTw"
  },
  {
   "Date_Posted": "11/18/2010",
   "Review_Comment": "Born in bred in Clayton County (and currently working here), there isn't much about my old stomping grounds that I can actually rave about. Enter Taqueria La Oaxaquena. Game changer. Very glad my friend and I gave this place a shot back in their old locale. It is good enough for me to head to this side of town on a non-workday, so 5 stars!\nI am a sucker for salsas, and dios mio, this place has 'em. Be prepared for your food to take a few minutes to come out (might I suggest a basket of chips and one of the several aforementioned salsas to kill time), but once it gets to you, you are in for a treat. I like to go with the bean and cheese gordita and an order of rice. The gorditas are substantial, and the order of rice is enough for two people.\nThere are several dessert offerings that I have never tried (always too full!), and they have TVs tuned into either Ranchero or modern Spanish-language music videos.\nNot too shabby for something running out of an old Captain D's restaurant :)",
   "Name": "Melissa P.",
   "Name_url": "https://www.yelp.com/user_details?userid=iYv2IpUjdU2hKkjjASIdww"
  },
  {
   "Date_Posted": "9/13/2010",
   "Review_Comment": "While the food was excellent and the selection of authentic foods outstanding, the service was mucho slow. Don't get me wrong, the server was super nice and willing to explain what items were that were on the menu, but it took about 30+ minutes to get our food!! That's cool except the place was jumping with kids, including the ones in our party.\nI ordered the Pork strip huarache and was not expecting for to be so gargantuous!!! It was just over a foot long and about 8\" wide!!! There was probably a pound of pork on top! Since it was only $5, I also ordered two goat tacos (still thinking small portions) only to find that the TACOS were approximately a 1/2 lb a piece themselves!!! I was dumbfounded at the portions and I can put down some food!!\nMy friend ventured into ordering the giant tallyuda (spelling??) which the server described at a \"two person meal\". I'd like to see the thighs on those two people cuz my friend's a big boy and barely made it thru a 1/4 of the behemoth.\nDefinitely a family spot for all with a relaxed environment. If I lived close to it, it would be a regular spot. Make sure you hit the \"salad\" bar (I quoted that since there's not any \"salad\" like you think of being on a salad bar....) and try the yummy cactus and fiery hot marinated peppers.\nAgreed, best Mexican food I've had, but don't expect any Americanized fare here!",
   "Name": "Britters B.",
   "Name_url": "https://www.yelp.com/user_details?userid=_-hli9hkPePgEnisf9bUcA"
  },
  {
   "Date_Posted": "2/11/2011",
   "Review_Comment": "Daniel was looking at a truck way down here and his rents were up in North Atlanta doing some business. They wanted to meet us for dinner and I got them to meet us here. I was really nervous because they are Maconers but were strangely excited about getting real Mexican (they lived in Cali for 15 years).\nI ordered a chicken and green chile tamale, Al Pastor sope, and Asada (steak) medium burrito. It ended up being way too much food for me. So I have the burrito for today. :)\nTamale: Sigh this was as good as King Taco in L.A. Much better than the MSG loaded version served at Nuevo Laredo. This guy was also only $2.99.\nSope: If I could make love to a food this would be it. These are hard to find in Georgia and it was perfect. Sort of like a mini pizza, it's like a thicker tortilla with pinched edges. Lightly fried, served with meat, beans, lettuce, acidified cream, and some soft white cheese on top.\nBurrito: I tried a bite of it last night and was slightly disappointed. I had ordered all the American garbage off of it and they still but it on. It's ok, I will be more insistent not to have so much damn filler in it next time.\nDaniel got a pork tamale and chicken burrito. He was in a food coma by the end of it. His mom got a cheese quesadilla and his dad got the flauta platter. They both were very happy and groaning in delight from their orders.\nService wise the waitress was very kind and quick to fill our water cups. The restaurant was clean and the salsa bar was banging. I loved the corn salsa (spicy) and the pickled radishes.\nHe needs to pick up his truck tomorrow and guess where we are going for lunch tomorrow? I'm going to try the tacos next. :)\n#Yelp365 - 42/365",
   "Name": "Nancy B.",
   "Name_url": "https://www.yelp.com/user_details?userid=Wz2nKqB7xHFpr7L9z_ng0g"
  },
  {
   "Date_Posted": "10/28/2014",
   "Review_Comment": "Superb, authentic, Mexican food! I'm from Texas where taquerias abound, and when I crave real tacos or tortas this is where I go.",
   "Name": "Michal J.",
   "Name_url": "https://www.yelp.com/user_details?userid=Iuh1iR4T6fpap82vHLGbTA"
  },
  {
   "Date_Posted": "6/12/2011",
   "Review_Comment": "A recent stop on the never-ending trek to find breakfast tacos for my boyfriend. He wants chorizo + eggs in a tortilla and i will go to the ends of the earth to find it for him so he can have sensory flashbacks to Honduras and Austin.\nWe headed down to TLA on a Saturday morning - they are open for breakfast daily. A few families were scattered and a few more trickled in.\nOur server was a Druid Hills High student who chatted us up relentlessly about her summer job, travel, and parents and siblings. She was cute but it started to feel like a table for 3.\nThe tamales are the star here - we shared one and I think when we go back we'll stick exclusively to tamales. I opted for Chilaquiles which were huge and spicy with salsa verde - delicious but massive.\nZ had tortillas with chorizo and eggs - the eggs were a little rubbery. Not sure I would cling to the huevos here, despite it being breakfast.\nI enjoyed the fun salsa bar and we definitely loved the authenticity of the place. I had been to the old location and this one is a huge step up in size, cleanliness and just general sketchiness.\nWorth the trip for authentic mexican. A fun breakfast but don't go too egg-heavy.",
   "Name": "Sarah M.",
   "Name_url": "https://www.yelp.com/user_details?userid=clVxNV2CYaBUEw9A6-a2HQ"
  },
  {
   "Date_Posted": "11/7/2013",
   "Review_Comment": "Great Food...Excellent Service...Reasonably Priced...Authentic Mexican...Will Not Hesitate To Return...",
   "Name": "David E.",
   "Name_url": "https://www.yelp.com/user_details?userid=aGu9WwdJnWnWpyzPbJVf5w"
  },
  {
   "Date_Posted": "9/15/2010",
   "Review_Comment": "Even mid-afternoon, this place is packed -- and for good reason. The food here is outstanding.\nAlthough the menu is quite extensive, I came here for the tacos. On their own, they run between $1.99 and $2.50 a piece, which isn't particularly cheap. Instead, I went with the al pastor platter ($8.50), which comes with enough pastor to fill five tortillas, along with beans, rice, and a small salad.\nThe large portion of (likely pan-fried) pastor was quite flavorful, owing in particular to the generous amount of sliced onions they had thrown into the mix. The tortillas were somewhat thick, quite large in diameter, and durable enough that I didn't have to double layer them. The usual cilantro and chopped onion were there, of course, along with a few extra raw vegetables on the side; the green and red salsas were both pleasant enough (check out the salsa bar); and the meal is accompanied by a few green onion bulbs and jalapeno peppers, both grilled. Satisfying.\nThe selection of aguas is a bit limited -- I went with the melon over the horchata and only one other choice -- but what's there is solid.\nThis place is probably a little out of the way for many people, being so south OTP, but it's worth stopping by if you're in the area. That's, of course, of no consequence with regard to my rating.",
   "Name": "Robert C.",
   "Name_url": "https://www.yelp.com/user_details?userid=Fi6hIZuu0eq8YpaRq-sb0w"
  },
  {
   "Date_Posted": "11/1/2013",
   "Review_Comment": "Best Mexican food in years. The staff was very friendly , and they even gave us free dessert . We will most definitely be coming back. I real gem in the rough.",
   "Name": "Everette N.",
   "Name_url": "https://www.yelp.com/user_details?userid=e2OORL9dWObJU4nA0Euj6g"
  },
  {
   "Date_Posted": "1/27/2010",
   "Review_Comment": "After reading John Kessler's article about Taqueria in the AJC and finding that Creative Loafing voted it the best Mexican restaurant two years in a row, it was time to make a journey to Jonesboro to try this place out. It's not your typical Tex-Mex joint. There are no combinations and no frozen margaritas, but judging from the clientele sitting down as we walked in, we knew we were in for some delicious authentic Mexican cuisine.\nNothing disappointed (including the service) and there was a wide variety of things to pick from. One notable was the tlayuda. It's like Mexican pizza. You get a huge tortilla topped with your choice of meat (asada was awesome), refried beans, jalapenos, radishes, tomatoes, lettuce and quesillo (like Mexican string cheese). The mole chicken (also served with rice and beans) was also impressive. Some of you have probably been to Nuevo Laredo and tried the mole there, but this mole was more flavorful and the consistency was better. They even have tortas and tamales featuring the mole. You've gotta try it. The tacos are also a good deal for $1.99. Try the lengua (beef tongue). The salsa bar featured five different salsas and they even had cactus which were perfect accompaniments for chips and on top of our main dishes. Finally, tres leches was a perfect ending to the meal for dessert.\nWe will definitely be making a return trip in the near future to try the other menu items that we just didn't have room for and I can't wait to have my leftover tlayuda for lunch. Like John Kessler said in the AJC article, \"Again, I ask: Is there a better Mexican restaurant in the city?\"",
   "Name": "Destin D.",
   "Name_url": "https://www.yelp.com/user_details?userid=Ehwcp92uuQN1f9gtkshSFg"
  },
  {
   "Date_Posted": "4/21/2013",
   "Review_Comment": "My family and I have been to this restaurant a couple of times. I had the bean and cheese sopes. Its pretty good with the exception of the slightly bitter taste. Not sure if it was the sour cream or melting cheese. Other than that it was good. Also had their tacos. Has steak and alpastro. They were average. It was missing a little salt. But I was really impressed with the hand made tortilla. Overall it was good had a few minor details that need to be fix but nothing that will stop me from coming again.",
   "Name": "Diana B.",
   "Name_url": "https://www.yelp.com/user_details?userid=x_1mWpFNwiZtGunbeGsugg"
  },
  {
   "Date_Posted": "12/13/2009",
   "Review_Comment": "For someone bored by the Mexican places around midtown, Taqueria La Oaxaquena's diverse menu is refreshing. It's not the same old #1-#57 pick some combination of chicken or beef tacos, enchiladas and burritos plus rice and beans.\nThey've got all of the stuff you can't find there: goat meat dishes, cow cheek, tongue and trip dishes, pozole (on Sat. and Sun.), pork al pastor, carnitas, pickled pigs feet, and a bunch of Oaxacan regional stuff. Last time I got myself a goat taco, an al pastor gordita, and a banana leaf tamale (the filling is chicken mole).\nLiked:\n* Extensive salsa bar -- they've got a variety of salsas, pico de gallo, pickled vegetables and a bunch of other stuff.\n* The goat taco and pork al pastor gordita were excellent.\n* I like how the tacos come with a lot of \"fixings\". They give you a whole jalapeno, onion and radishes (along with the other stuff available at the salsa bar).\n* The gordita comes with a side of shredded Oaxacan cheese which is great to add to the gordita and tacos.\n* The steak a la mexicana was tender, not chewy or dry and the flavor was good with a nice level of spice.\n* Freshly made tortillas\nNot much I didn't like, but minor caveats:\n* The banana leaf tamale didn't have enough filling, IMO. There was too much masa and not enough mole and chicken.\n* Some of the a la carte prices are a bit high.\n* You have to pay for chips and salsa. That's a very minor gripe, but the vast majority of Mexican places don't charge so it stands out by comparison.\nNext time I'll have to try a Tlayuda. Also, the desserts looked interesting -- I always want to get tres leches cake when I see it on a menu since it's good but I hardly ever see it places I go.",
   "Name": "David H.",
   "Name_url": "https://www.yelp.com/user_details?userid=t6KU6I71YriFsmQx0XwArA"
  },
  {
   "Date_Posted": "8/20/2013",
   "Review_Comment": "This is a wonderful Mexican restaurant better then La Parilla and La Hacienda. It also has great lunch specials! It really is worth a try you won't regret it.",
   "Name": "Toneysha I.",
   "Name_url": "https://www.yelp.com/user_details?userid=UOkSkPnqt9sLBC6WSlvduw"
  },
  {
   "Date_Posted": "5/24/2010",
   "Review_Comment": "Somehow, I manage to finagle my weekend errands so I land here at meal time. Of course, I love this taqueria enough that any time is meal time when I am in the neighborhood. We always order way too much food - oh well, lunch the following day was delicious, too.\nFavorites - gordita with the pork ribs in green sauce. YUM!\nHuaraches (thick tortilla-like vessel) with refried beans, meat of your choice (carnitas this time), lettuce, crema, sprinkling of cheese.\nSope (thick masa cake) with chorizo and toppings. Delicious, not too greasy from the chorizo.\nTacos - any meat choice works here, too - al pastor has just the right amount of pineapple/sweetness. One perfect tortilla, a good amount of meat, chopped onions, cilantro and a squeeze of lime. It all works perfectly.\nI have only had the tlayuda once years ago and keep meaning to try it again. We just start ordering one of everything else and never leave room for it.\nService was fast and friendly, Latin variety show on the TV was entertaining (and not so family-friendly), salsa bar rocks! Hmmm....how soon can I get back down to the Southlake area again?!",
   "Name": "Randy D.",
   "Name_url": "https://www.yelp.com/user_details?userid=5a24OpwpEtwBBoBfvE9OTw"
  },
  {
   "Date_Posted": "5/29/2013",
   "Review_Comment": "Super fresh homemade . Fun fresh salsa bar. Friendly service . A nice surprise for a boring commercial area.",
   "Name": "John G.",
   "Name_url": "https://www.yelp.com/user_details?userid=cjiyUf3tmNb6tplHtQFssg"
  },
  {
   "Date_Posted": "10/14/2009",
   "Review_Comment": "Anyone who follows my reviews knows I love good Mexican food. My favorite spots for good, cheap Mexican have had to take a back seat to this place lately. I would go here all the time if not for it being located in old town Jonesboro. Since I started going to grad school in Southeast Georgia, I have been hitting this place often on the way to and from school. You cant go wrong with anything on the menu. Everything is delicious and cheap. The salsa bar is not to be missed and is perhaps the best in ATL. My favorite is the burrito with your choice of meat and done \"all the way.\"",
   "Name": "Robert M.",
   "Name_url": "https://www.yelp.com/user_details?userid=T64Ja4Z032rayyb3P6UE_w"
  },
  {
   "Date_Posted": "6/1/2012",
   "Review_Comment": "Delicious food! And super reasonable prices too.\nHands down the best quesadilla I've ever had in my life... and it was vegetarian :) My brother had the puerco con salsa verde - he said it was \"OK\", but I don't trust his food expertise haha. The meal came with a huge basket of tortilla chips and salsa, which were yummy. The salsa bar is there in case you need refills too. The spicy garlic salsa - I didn't the name - was absolutely marvelous.\nService was very friendly and our waiter helped us decide which foods we wanted; it was especially useful for me, since I don't eat meat.\nWe had a flan and rice pudding for dessert. Skip the rice pudding next time - nothing special - but DO get the flan! oh, a HUGE HUGE slice of flan for only $3.50! The one thing that could have been better was the temperature of the flan - it should always be ice-cold and firm, but the taste was still awesome.\nWill be returning!",
   "Name": "Lina V.",
   "Name_url": "https://www.yelp.com/user_details?userid=zhMVE7tW0R_qw_yTNVQI4g"
  },
  {
   "Date_Posted": "5/2/2012",
   "Review_Comment": "Hands down, this place has delicious, AUTHENTIC Mexican food! I loved everything I ordered and this will become my new spot when I'm craving south of the border fare! You know you've found a great spot for Mexican food when almost everyone in the place is Mexican!",
   "Name": "Shannan M.",
   "Name_url": "https://www.yelp.com/user_details?userid=wtEvcyv0h_GNox3Mgy9VfQ"
  },
  {
   "Date_Posted": "1/6/2010",
   "Review_Comment": "Had read about them for a while, and finally we were on the southside and decided to stop in. Spent a bit over 50 bucks on take out, but it was a huge amount of food. They were very friendly and the manager even gave us some complementary rice pudding to nosh on while we waited.\nMole chicken: large leg and large thigh in mole, w/rice. Excellent.\nTlayuda with steak: essentially a Mexican pizza. Put some of their sauces on it for some extra kick. Yum.\nCarne Asada: huge amount of beef, onions, peppers. I cut up the beef so we could eat it on tortillas. They gave plenty of tortillas.\nChicken enchiladas: The red sauce is somewhat hot, but they were very good.\nA couple of tamales. We got some rice, but some meals came w/rice. We also got some beans, which were excellent. Next time, more beans.\nThis all fed 4 adults well, and we had leftovers for two that took us a couple more days to eat.\nIt was all excellent, everything is probably even a buck or two less than the same things at some other Mexican restaurants.\nIt's a bit of a drive, but if you are ITP or on the southside, you can get there in under 20 minutes probably. Go!",
   "Name": "jim b.",
   "Name_url": "https://www.yelp.com/user_details?userid=KSJmpVpLW_SY3YBfAIfWag"
  },
  {
   "Date_Posted": "8/16/2009",
   "Review_Comment": "What am I doing here? I'm vegetarian and can't eat corn! But yum... the few dishes I can eat here are absolutely delicious, and make Jodi happy because I'm willing to drive OTP on the *south* side of Atlanta for this stuff.\nI had the huevos divorciados (\"divorced eggs\"), three eggs over easy with green chile sauce on some and red chile sauce on others. It came with beans and rice and five small flour tortillas, making it a damn good $6.95 \"breakfast\" (available all day).\nShe had the chicken flautas. Ordinarily she's not a fan of sour cream, but the crema here suited her just fine on top of the cigar-sized rolls of chicken inside fried corn tortilla, and all of that topped by lettuce and avocado, and this, too, came with rice and beans.\nHow in earth did we find room for the pastel de tres leches, a Rubik's Cube-sized slab of coconut cake swimming in sweetened evaporated milk? Taste it. You'll see.",
   "Name": "Ben O.",
   "Name_url": "https://www.yelp.com/user_details?userid=EIt66bYmFr_2kbs5qsL-0Q"
  },
  {
   "Date_Posted": "1/27/2013",
   "Review_Comment": "Fresh delicious food! Nice people. Wish I lived closer, I'd be here once a week.",
   "Name": "Susan T.",
   "Name_url": "https://www.yelp.com/user_details?userid=NNbs_XC8n7i6ePLhsOv02A"
  },
  {
   "Date_Posted": "3/30/2009",
   "Review_Comment": "So, here's the thing....\nI was waxing philosophic to a friend about the lack of quality Taqueria's in Atlanta, I thought maybe I was just looking in the wrong places, but after months of searching I had given up and resigned to turning my kitchen into Bianca's Taqueria whenever I might be in the mood for a kick ass veggie taco. That was until there was La Oxaquena...\nLa Oaxaquena had me at \"Hola\" the menu does not disappoint, they have every kind of Torta, Flauta, Taco, Quesadilla, and Tamale you could imagine. On my trip I had a cheese, guacamole quesadilla and a veggie and cheese gordita. Since becoming a vegetarian I sometimes find it difficult to fully enjoy some of my favorite foods sans meat, the flavor isn't always the same, but La Oaxaquena has filled me with such vegetarian delight and flavor I'll never doubt my decision to go veg ever again.\nMy quesadilla was wonderful, the tortilla was crisp yet soft, the cheese was melty and gooey but not greasy, my gordita was heaven, fluffy masa formed into a cake, and then grilled crispy on the outside and filled with cheese and lettuce, sour cream, guacamole and tons of salsa. Its no surprise to any of my friends that the ultimate dining experience for me includes the right balance of crunchy and and crispy textures, a trip to this Taqueria leaves me beyond satisfied....\nThis place is a little out of the way, but the service is good, the portions are large, and the waitstaff is helpful ad patient, 5 stars all the way.",
   "Name": "Bianca W.",
   "Name_url": "https://www.yelp.com/user_details?userid=s2mt3CAfM5gaomDcKaifbQ"
  },
  {
   "Date_Posted": "1/6/2010",
   "Review_Comment": "Love this place. Great food, good service. There was a slight delay last time-- the one day I was actually in a hurry to eat and leave quickly-- but otherwise, they're speedy and friendly. The friendly sombrero-wearing gentlemanstatue out front welcomes you to dine (if it is around Christmas, he may be dressed as Santa!)\nAs for the eats, I recommend the gordita with huevos in it. SO GOOD. It's like a delicious, spicy, puffy breakfast... thing (that thing being a gordita). If you order two gorditas, you will probably be very, very full afterwards. One gordita + one taco seems a bit more sensible. Lots of meats to choose from for tacos; the chorizo taco makes for a nice breakfast combo with the huevos gordita, if you're into that kind of thing (and I AM.)\nTwo people can probably share the order of rice and be satisfied.\nGet the grapefruit/Toronja Jarritos. It's the best!",
   "Name": "Gray W.",
   "Name_url": "https://www.yelp.com/user_details?userid=nB3dJ4gORnP5Dxp84F2yOA"
  },
  {
   "Date_Posted": "5/17/2014",
   "Review_Comment": "Best Mexican food in GA period. It reminded me of my mom's cooking. Genuine Mexican. I ordered the menudo and a pastor taco. The salsas are to die for they are hand made. I lived and raised in Mexico and the food is genuine taste. I joined the service and had traveled all over the place and is difficult to find good Mexican food outside of los angeles or san diego. My family ordered the puerco en chile verde and it was very good it even had nopales on it.",
   "Name": "Andy O.",
   "Name_url": "https://www.yelp.com/user_details?userid=D1yE2c-LylrPIQVtF4-Xeg"
  },
  {
   "Date_Posted": "1/1/2012",
   "Review_Comment": "Kind of divey but the food is awesome. Had one of their famous tlayudas and while I wouldn't drive out of my way for one, if you happen to in the neighborhood, definitely try one.",
   "Name": "Heather S.",
   "Name_url": "https://www.yelp.com/user_details?userid=OVybYv9Ony6z276wn13pcw"
  },
  {
   "Date_Posted": "11/6/2011",
   "Review_Comment": "you know is good when all the staff speaks spanish and spanish tv is on in the background. and def order the huge orange juice is nice to share for 2\ni usually dont eat mexican food outside of mexico but this place is pretty good. and compare to everything close by, that's ur only safe bet.\nsolid 4!!",
   "Name": "Donald F.",
   "Name_url": "https://www.yelp.com/user_details?userid=-HHdrdU7t_QWlghzaQycmg"
  },
  {
   "Date_Posted": "6/25/2010",
   "Review_Comment": "JUST DO IT ALREADY!\nHands down, the best mexican food in Atlanta.\nBARING WITNESS:\nI felt the spots forming at the back of my head... I knew that the spots would soon become beads... In five minutes, these beads would turn to trickles... I felt it coming, it didn't care that it was coming, it came in a downpour, and I still couldn't stop eating... The habaneros kicked me, then kicked me some more, and then I kept begging for more pain... I couldn't help myself.\nWHAT I HAD:\n- The Drink: Horchata which came in a super-sized cup. Cool, refreshing, sweet, without being too syrupy or runny. Nice...\n- Chips: They're not free, but due to the quality of the salsa bar here, you MUST order a batch. Absolutely mandatory to try the salsa bar.\n- Entree Uno: Gordita with Pork in Green Chile Sauce. Simply put, awesome. Hot, stewed pork smothered with home made green chile, poured between the corned layers. Really hits the spot.\n- Entree Dos: My poor, rich mid-section... Tlayuda with Chorizo. For those who don't know, its sort of like a mexican Pizza. On a layer of baked tortilla, toppings include meat (your choice), avacado, radish, tomato, fried jalapenos, and stringed cheese... A group came in just as I started eating, and the young lady asked me what it was... About 15 minutes later, she was getting one topped with carne asada (grilled steak). \"Nuff said.\n-The Salsa Bar: Unlike other spots I've been too, these guys, actually put everything on ice, to keep it fresh. Just as I was ordering, I saw them pouring in the buckets of ice, before placing in the various salsas, which included the hot, green chile, pico de gallo, the radish, habaneros, guac, and an assortment of mixes that normally include onions, carrots, jalapenos, or habaneros. Great stuff that was fresh, and really gives the food an extra kick.\nHOW TO GET THERE:\nNot as bad as you think. Take I-75 south and the 2nd exit OTP is Hwy 41 south. Left at the first light, and its on your immediate right. Just go already!\nFINAL WORDS:\nIf its decor you want, go to any overpriced, underflavored tex-mex joints that are everywhere. But if you want no frills, authentic flavor, then make a trip down to Jonesboro. Well worth the hype.",
   "Name": "Canyouwoowoo W.",
   "Name_url": "https://www.yelp.com/user_details?userid=DG3fdREskVg2pNTYOMFl0Q"
  },
  {
   "Date_Posted": "8/7/2011",
   "Review_Comment": "OMG! Everything was amazing. Watch out for the green salsa. It is dangerously hot...and some of us like that. Try it all - even the cactus salad in the salsa bar.",
   "Name": "Alex B.",
   "Name_url": "https://www.yelp.com/user_details?userid=jvc2aRGgVEeuZ9LwWOvPtQ"
  },
  {
   "Date_Posted": "5/16/2011",
   "Review_Comment": "This was ok. I had the chicken flautas. I've had better. With that being said, my husband loved it.",
   "Name": "Libra M.",
   "Name_url": "https://www.yelp.com/user_details?userid=c3gb21YtIT6mLdNNR9FQ_w"
  },
  {
   "Date_Posted": "8/22/2010\nUpdated review",
   "Review_Comment": "I took mom here with some trepidation as we normally eat at La Parilla, and I was afraid this would be TOO authentic for her. But she made me take her to Southlake, so I made her eat here! She loved it. Disappointed at first that she couldnt get a margarita, but when the food arrived she was amazed at the size and the fun. Everyone was nice, that salsa bar is the bomb, the food so plentiful we had the leftovers for dinner. I made her get a cows cheek taco, since I wanted to try it, it was Soooo good, but its funny how some people wont like it because of its name. I would get that again. She liked her steak tacos alot. The bill said \"Taco americano\", bless her! I liked my Tlayuda. Busy- 3pm saturday and it was jammin! At first only mexicans! Good sign!",
   "Name": "Mark B.",
   "Name_url": "https://www.yelp.com/user_details?userid=SLYLzhyN1t9YdgfIxpwV4A"
  },
  {
   "Date_Posted": "10/11/2013",
   "Review_Comment": "Completely authentic Mexican food. Beef tongue and beef cheek tacos were fantastic. But they couldn't hold a torch to the Pozole soup. That was the best soup I can remember eating. The pork knuckles in the soup were a nice touch. The guacamole on the salsa bar was also fantastic. My only complaint is they put way too much salt in the chorizo. Lighten up on the salt. We can always add salt if we want it, but we can't take it out.",
   "Name": "R P.",
   "Name_url": "https://www.yelp.com/user_details?userid=IfjZbv44EV4T2q1qSJOa9w"
  },
  {
   "Date_Posted": "10/8/2013",
   "Review_Comment": "Best AUTHENTIC Mexican in Atlanta. Nothing fancy; just great food. The tacos, tamales, and horchata are the best around. And the salsa bar is awesome!",
   "Name": "Augustus G.",
   "Name_url": "https://www.yelp.com/user_details?userid=UU0OFv3ni6e7hwIXjueZ0w"
  },
  {
   "Date_Posted": "9/24/2007",
   "Review_Comment": "Sweet Madre de Dios.\nIf you are a gringo, you are likely to be the only one in the place. If you are put out by the sound of MTVLatino coming at you just a little bit too loud, then you might not be in the place for long. But if you are looking for authentic, lovingly made food from southern Mexico, you will leave very, very happy.\nThe tamales, green with chicken, red with pork, and option three with mole, are out of this world and insanely inexpensive. Order extra. They freeze nicely.\nBut the orgasm on a plate is the Tlayuda, a signature dish designed as an appetizer for three or four is an excellent meal for a single glutton. Think of the world's largest corn tortilla (14? inches across), topped with everything you could think of, including at least three kinds of cheese. I added on the little pork cracklings (other options include steak, chicken and extra cheese), and its a meal I've -- literally -- dreamed about ever since.\nNo cervezas, though. Bummer.",
   "Name": "David B.",
   "Name_url": "https://www.yelp.com/user_details?userid=9zSOxAZQIx7UvokICgfB-Q"
  },
  {
   "Date_Posted": "2/29/2012",
   "Review_Comment": "You'd never think that the best Mexican would be in Jonesboro, GA. Hell, you'd never think of Atlanta's best dining spots would be here. But it is. It's a straight shot down 75. Regarding Mexican food, this stands out more to me than any place in the city, including Buford highway. This place is no frills. It's all about the food. The service is good. The decor is plain. But these are not bad things. I got a kick out of the fact that when we arrived, they assumed we spoke Spanish. That was already a plus. This is an impressive menu. I asked our waitress what her favorite item was. Her response: \"Everything.\" I ordered the tlayuda. I don't speak Spanish, so I assume \"tlayuda\" means \"can feed four people.\" This thing was a monstrous piece of art. It's a large fried tortilla loaded with Oaxaca cheese, refried beans, chorizo (that's what I ordered), avocado, and lettuce. If there's any dish in recent memory where I could suppress that part of my brain that signals when you're full, this is the one. So many textures and flavors, that in a matter of a few bites this was rocketing up my list of favorite dishes in the city. This dish was exciting to eat. So first impression? It's settled for me. If I have a Mexican craving, I'm looking no further (though it is far). I can't wait to try everything else on the menu. This place is awesome.",
   "Name": "Jeff M.",
   "Name_url": "https://www.yelp.com/user_details?userid=z72G0C2kq0vP1vVX_EU2UQ"
  },
  {
   "Date_Posted": "5/7/2010",
   "Review_Comment": "Having been in Atl for quite a while, i kno there's quality mexican food everywhere. And even out in the Morrow area there's this little quaint restaurant. I've been to La Oaxaquena quite a few times now and its been consistent every time i've been. I usually come during lunch since i would never be in the neighborhood at sundown. Even in the daytime its iffy but the mexican food is so damn good here.\nSo when you are driving to Oaxaquena be aware that its on the southeast corner of Mount zion and tara blvd. The sign is a bit faded so you might miss it. Its right across the street from Mrs. Winners if that helps. The parking lot is a bit run down and the outside seems a bit tacky but when i go to a mexican restaurant i don't expect much in terms of decor. If there is a lot of decor i usually know my wallet is about to take a hit. Walking into the restaurant you will be greeted by a large statue of a rather stout mexican fellow with sombrero and all. The first thing i noticed after the stout sombrero wearing statue was the salsa bar. Im not sure of the official names but it had ure run of the mill salsa, tomatillo salsa, cactus salad, a roasted pepper salsa, and a few pickled items (my fav being the pickled jalapenos). Soon after a waitress will greet you and you will be seated.\nThe first time i came to the restaurant i was pleased to see a large contingent of mexican patrons. Its like going into a chinese restaurant and seeing chinese people. if they are eating here the food has to be decent. After giving my drink order i scanned the expansive menu. They had quite a bit on there. of course tacos and burritos were the staples but there were also a whole list of soups, entrees, and tamales. Since i usually come for lunch i settled for the grande burrito (which is filling enough for someone who eats a decent portion size. Their large burrito comes only with the burrito but for $5.75 its a good size and the salsa bar makes up for the sides that i would've got. My favorite burrito is the steak. It comes rolled with sour cream, cheese, rice, and beans. The steak is cooked well but has bits of fat which make it tender. The burrito also comes with a roasted pepper which is quite delicious. On the side I'll pile on some cactus salad and pickled jalapenos which comes with any meal. My buddies have tried the tamales and have stated for the price it can't be beat and the tortas are ok but I'd still have to go with El Pastor on Buford for a good quality tortas. I haven't experienced much on the menu besides the burritos, tamales, tortas, or tacos but have seen the other patrons order quite regularly.\nOverall La Oaxaquena is a quaint little mexican restaurant that serves good food, for good prices. the staff is friendly and speak fluent english so u'll never be guessing what they are saying. if you don't mind spanish music videos laden with scantily clad women playing on the flat screens then come on down to La Oaxaquena and you won't be disappointed.... happy eats!",
   "Name": "Vincent K.",
   "Name_url": "https://www.yelp.com/user_details?userid=Z54jLgO9EULgJAcQ9Ar4LQ"
  },
  {
   "Date_Posted": "4/14/2013",
   "Review_Comment": "My friends and I chose this place because of all the great reviews. When we read \"authentic\" we didn't realize this meant goat and cow tongue. That's truly authentic which is great but people should really realize that before you go. Yes they have basics such as quesadillas but they are with dark meat chicken.. Gross. Yes, I know I am used to the more tex mex but I've had Mexican food while actually in Mexico.. As authentic as you can get.. and it was delicious. This.. Not so much. We were the only non Latinos in the place which I personally was completely fine with but it was hard to get service and the waitress walks over and says \"you want quesadillas?\" Lol!! Quite an assumption.. I started to order the cow tongue just for principal! Ha ha! But ol whitey ordered the quesadilla! Guess she saw that coming. This place is obviously great for some but take these things into account when making your decision. :)",
   "Name": "Jen P.",
   "Name_url": "https://www.yelp.com/user_details?userid=M8b63xXJkeMgZz9AVudrow"
  },
  {
   "Date_Posted": "5/25/2011",
   "Review_Comment": "First off, let me just say that I wouldn't know an \"authentic\" Mexican dish if it sat up, barked twice, and ran off chasing its tail. (wait, maybe that's authentic Korean food... Hold on hold on, I'm a Korean so I'm allowed)\nAnyway, I do know good food and this place has it. I \"found\" the place back when it was in its strip mall roots, and while food was excellent there, seating was limited so it ruled itself out on several occasions. The new place -- apparently an old Captain D? -- is much larger and keeps the famous salsa bar. We went around 11AM and it was almost empty so I thought maybe the food quality went down, but never fear, as we were finishing up around noon, the place was closed to jammed and we had no doubts about the food.\nMy wife ordered... something. I can't remember because I ordered costillas en salsa roja and it was great. It's a pork rib dish with red sauce (also can be had en salsa verde), slow cooked and breaking apart with just a slight pressure from your fork. Excellent dish. $5.99 lunch special and comes with a drink in a huge styrofoam cup. Refill is a $1 but, seriously, it's enough to douse the flames you set in your mouth by sampling all the options on the salsa bar. I tend to drink a lot while I eat, but I still left with about a 3rd of drink still in the cup. I piled on some onion and habanero with (maybe) lime juice, pickled jalapeno, radish (great for extinguishing fires in your mouth), and several different salsa. Of the salsa, only one was truly hot, a habanero salsa the staff kindly labeled \"super extra hot.\" Others were mild to low-medium range, so if you visit and get emboldened by these lesser salsa and take this \"super extra hot\" salsa lightly, prepared to have your sinus ventilated through the roof of your mouth. And understand: what goes in, must come out. A day later to be sure, but it does.\nI also ordered carnita taco and chorizo. Chorizo was meh but canitas was excellent.",
   "Name": "Chae A.",
   "Name_url": "https://www.yelp.com/user_details?userid=9EuKi_cTTf97A9jMHRiwBg"
  },
  {
   "Date_Posted": "11/14/2011",
   "Review_Comment": "this place is the real deal -- real mexican food !! it is very tasty and reasonably priced -- the place is a bit of a dive, but the food is worth it",
   "Name": "Dan K.",
   "Name_url": "https://www.yelp.com/user_details?userid=9U4ItWl_1UuP1yGqSnoy3w"
  },
  {
   "Date_Posted": "9/29/2012",
   "Review_Comment": "Finally my search for authentic delicious Mexican food is over. This is the best Mexican food in the Atlanta area.",
   "Name": "Susanna C.",
   "Name_url": "https://www.yelp.com/user_details?userid=XjKF35hWHUkmrw0ZwSpL7A"
  },
  {
   "Date_Posted": "3/13/2011",
   "Review_Comment": "OK, I enjoy Mexican food but sadly my family doesn't enjoy the authentic only mediocre stuff. I am disappointed they do not have queso fundido (in fact there were querulous looks when asked) however the rest of the menu is bountiful and far ranging in choices usually not found. That being said, any food ordered will be satisfying and more than sufficient. Carne lingua is exceptionally tender, tamales, sopes, burritos, cerviche, all good. I did not care for their chorizo...dry and overcooked.",
   "Name": "john k.",
   "Name_url": "https://www.yelp.com/user_details?userid=w4a12OYuImh084MNF3pGMQ"
  },
  {
   "Date_Posted": "2/9/2010",
   "Review_Comment": "I read about this place in the Creative Loafing and went there last week to check it out. It was really good! I am vegetarian so sometimes it's hard to find things to eat at Mexican restaurants, but this one had a few choices. I got the Tlayuda, and it was quite good. Very interesting Oaxacan cheese that I've never had before. My friend got gorditas which were very tasty. This is now one of my favorite Mexican restaurants in metro Atlanta, although I still prefer Nuevo Laredo Cantina.\nLooking forward to going back to try more items off the menu. They are open past 10pm too, which is a plus.",
   "Name": "Tyler T.",
   "Name_url": "https://www.yelp.com/user_details?userid=2N4dNjHd09Tj0JfQwK0BGQ"
  },
  {
   "Date_Posted": "12/19/2011\nUpdated review",
   "Review_Comment": "We have frequented this place for about a year and had excellent service and food. That being said, we were very disappointed with our meal on a recent Sunday afternoon. The chips, salsa, and salad bar were spot on, as usual; but our entrees and the service were not up to par. We ordered the green chicken and red pork tamales and could barely find any meat in them. I ordered a side of Mexican rice, but, after 3 reminders, it never came. I hope this experience was a fluke. We've always eaten here during the week, so maybe it was a different staff. I certainly hope this is the case, because we have become quite fond of Taqueria La Oaxaquena.",
   "Name": "deborah m.",
   "Name_url": "https://www.yelp.com/user_details?userid=DMOcj256MBcomsZRbcWVkA"
  },
  {
   "Date_Posted": "10/6/2007",
   "Review_Comment": "Virtually everything on the menu at this taqueria is outstanding and it is hard to go wrong with whatever you order. Most people travel the distance for their tlayudas, which are 12-inch tortillas smothered in every topping imaginable and your choice of meat--the chorizo is my favorite. The salsa bar will knock your socks off with choices like a smoky red salsa and a bright green version thick with avocado.",
   "Name": "Blissful G.",
   "Name_url": "https://www.yelp.com/user_details?userid=5ZP2_iczfaM9ioqljU2Zog"
  },
  {
   "Date_Posted": "10/30/2010",
   "Review_Comment": "This is probably the best Mexican I have had since moving to Atlanta. They have a lot of specialties that are hard to find elsewhere, such as sopes and huaraches, and an assortment of meats that can't be beat. I had a tamale and two sopes (carnitas and cabeza), both of which I would highly recommend. The staff was very quick and courteous. I have no complaints. I can't wait to go back and try more of their food.",
   "Name": "Andrew S.",
   "Name_url": "https://www.yelp.com/user_details?userid=RNbYbMzN40rZIFvQVt1cDg"
  },
  {
   "Date_Posted": "12/5/2009",
   "Review_Comment": "Wow! I decided to go here, after reading all the good reviews.. I ordered the Tlayuda, with chorizo. OMG it was sooo good. The staff is super friendly, and the salsa bar is awesome.",
   "Name": "Fresh F.",
   "Name_url": "https://www.yelp.com/user_details?userid=FCPt5IPRJ1u7-vyZH90uqQ"
  },
  {
   "Date_Posted": "2/26/2010",
   "Review_Comment": "Best Mexican food in southeast U.S. Simply amazing menu selection, the food is just fantastic across the board.",
   "Name": "john m.",
   "Name_url": "https://www.yelp.com/user_details?userid=VYZp_UEFuWnrkgevn7TJHQ"
  }
 ]
}